Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <baseAddress>0x40012800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC3</name>
      <baseAddress>0x40013C00</baseAddress>
      <interrupt>
        <name>ADC3</name>
        <description>ADC3 global interrupt</description>
        <value>47</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC12_COMMON</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x40012700</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCR</name>
          <description>ADC common control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DUAL</name>
              <description>Dual ADC mode selection</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>VREFBUFEN</name>
              <description>VrefBuffer enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VREFBUFSEL</name>
              <description>VREFBUF output voltage select</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>VREFEN</name>
              <description>VREFINT enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>VSENSESEL</name>
              <description>VTS selection</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>VBATSEL</name>
              <description>VBAT selection</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>ADC power mode</description>
              <bitRange>[26:25]</bitRange>
            </field>
            <field>
              <name>VREFSEL</name>
              <description>ADC reference selection</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <baseAddress>0x48002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <description>AES global Interrupt</description>
        <value>70</value>
      </interrupt>
      <registers>
        <register>
          <name>MSG_CFG</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>AES_GO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MSG_END</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MSG_BEGIN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ALGODIR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ALG_MODE</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>MAC_LEN</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>KEY_SIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CFG</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CTX_RET</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTX_STR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INV_KEY_RET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INV_KEY_STR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTX_INDEX</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG_TOTAL_BYTES</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>TOTAL_BYTES</name>
              <bitRange>[27:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG_AAD_BYTES</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>MSG_LEN</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>ADD_LEN</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GCM_AAD_INFO</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ADD_LEN_TOT</name>
              <bitRange>[27:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY0</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>KEY0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY1</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>KEY1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY2</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>KEY2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY3</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>KEY3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY4</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>KEY4</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY5</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>KEY5</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY6</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>KEY6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_KEY7</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>KEY7</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CBC_KEY0</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CBC_KEY1</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CBC_KEY2</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CBC_KEY3</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CTR0</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CTR1</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CTR2</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_CTR3</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>CBC_KEY3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_IV0</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>IV0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_IV1</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>IV1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_IV2</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>IV2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_IV3</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>IV3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_MAC0</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>MAC0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_MAC1</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>MAC1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_MAC2</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>MAC2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTX_MAC3</name>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>MAC3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INGRESS_FIFO</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>INGRESS_FIFO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ING_DBCFG</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>DST_TR_WIDTH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>DMA_EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>PLAINTEXT_REQ</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_ENG_LEN</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>ENGRESS_DMA_DATA_LENGTH</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ENG_DBCFG</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>SRC_TR_WIDTH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>DMA_EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CIPERTEXT_REQ</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_ING_LEN</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>INGRESS_DMA_DATA_LENGTH</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INGFIFIF_STATUS</name>
          <addressOffset>0x94</addressOffset>
          <fields>
            <field>
              <name>ING_EMPTY</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ING_FULL</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENGRESS_FIFO</name>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>INGRESS_FIFO</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENGFIFO_STATUS</name>
          <addressOffset>0x9C</addressOffset>
          <fields>
            <field>
              <name>ENG_EMPTY</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENG_FULL</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ING_DMA_DONE</name>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>DMA_INGRESS_DONE</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENG_DMA_DONE</name>
          <addressOffset>0xA4</addressOffset>
          <fields>
            <field>
              <name>DMA_NGRESS_DONE</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE_STATUS</name>
          <addressOffset>0xA8</addressOffset>
          <fields>
            <field>
              <name>AES_DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_VAILD</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
