Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BKP</name>
      <baseAddress>0x40006C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TPE</name>
              <description>TAMP enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TPAL</name>
              <description>TAMPER pin interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CTE</name>
              <description>clear TAMP event</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTI</name>
              <description>clear TAMP interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TPIE</name>
              <description>TAMP interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEF</name>
              <description>TAMP event flag</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIF</name>
              <description>TAMP interrupt flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CAL</name>
              <description>RTC calibration value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>CCO</name>
              <description>Calibration clock output</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ASOE</name>
              <description>Alarm or second output enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ASOS</name>
              <description>Alarm or second output selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR0</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR1</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR2</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR3</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR4</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte4</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR5</name>
          <addressOffset>0x94</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte5</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR6</name>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte6</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR7</name>
          <addressOffset>0x9C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte7</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR8</name>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte8</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR9</name>
          <addressOffset>0xA4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte9</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR10</name>
          <addressOffset>0xA8</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte10</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR11</name>
          <addressOffset>0xAC</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte11</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR12</name>
          <addressOffset>0xB0</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte12</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR13</name>
          <addressOffset>0xB4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte13</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR14</name>
          <addressOffset>0xB8</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte14</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR15</name>
          <addressOffset>0xBC</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte15</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR16</name>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte16</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR17</name>
          <addressOffset>0xC4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte17</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR18</name>
          <addressOffset>0xC8</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte18</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR19</name>
          <addressOffset>0xCC</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte19</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR20</name>
          <addressOffset>0xD0</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte20</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR21</name>
          <addressOffset>0xD4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte21</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR22</name>
          <addressOffset>0xD8</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte22</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR23</name>
          <addressOffset>0xDC</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte23</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR24</name>
          <addressOffset>0xE0</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte24</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR25</name>
          <addressOffset>0xE4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte25</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR26</name>
          <addressOffset>0xE8</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte26</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR27</name>
          <addressOffset>0xEC</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte27</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR28</name>
          <addressOffset>0xF0</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte28</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR29</name>
          <addressOffset>0xF4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte29</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR30</name>
          <addressOffset>0xF8</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte30</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR31</name>
          <addressOffset>0xFC</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data byte31</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
