Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <groupName>COMP</groupName>
      <baseAddress>0x40016C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>COMP1</name>
        <description>COMP1 global Interrupt</description>
        <value>73</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>COMP1 enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_VSEL</name>
              <description>VREFCMP DIV SOURCE voltage select</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>INNSEL</name>
              <description>COMP1 negative input select</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>COMP1 positive input select</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>COMP1 window mode enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BLANKSEL</name>
              <description>Comparator 1 blanking signal selection</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP1 output polarity selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>COMP1 hysteresis function enable control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP1 power mode selection</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV</name>
              <description>COMP1, COMP2 partial voltage selection</description>
              <bitRange>[25:20]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV_EN</name>
              <description>VREFCMP voltage divider enable signal</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>COMP_VCSEL</name>
              <description>VREFCMP reference source selection</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>TIM_EXTI_OUT_SEL</name>
              <description>COMP1 output to TIM/EXTI selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP1_OUT</name>
              <description>COMP1 output status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMP1_CSR registerlock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN1</name>
              <description>Comparator 1 digital filter configuration</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT1</name>
              <description>Comparator 1 sampling filter counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2</name>
      <baseAddress>0x40016C10</baseAddress>
      <interrupt>
        <name>COMP2</name>
        <description>COMP2 global Interrupt</description>
        <value>74</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP3</name>
      <baseAddress>0x40016C20</baseAddress>
      <interrupt>
        <name>COMP3</name>
        <description>COMP3 global Interrupt</description>
        <value>75</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP4</name>
      <baseAddress>0x40016C30</baseAddress>
      <interrupt>
        <name>COMP4</name>
        <description>COMP4 global Interrupt</description>
        <value>76</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CORDIC</name>
        <description>CORDIC global Interrupt</description>
        <value>71</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Function</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PRECISION</name>
              <description>Precision required (number of iterations)</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>SCALE</name>
              <description>Scaling factor</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>IEN</name>
              <description>Enable interrupt</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMAREN</name>
              <description>Enable DMA read channel</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DMAWEN</name>
              <description>Enable DMA write channel</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NRES</name>
              <description>Number of results in the CORDIC_RDATA register</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>NARGS</name>
              <description>Number of arguments expected by the CORDIC_WDATA register</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RESSIZE</name>
              <description>Width of input data</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ARGSIZE</name>
              <description>Width of input data</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>RRDY</name>
              <description>Result ready flag</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDATA</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>ARG</name>
              <description>Function input arguments</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RES</name>
              <description>Function result</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
