Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>CRC data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>CRC independent data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RESET</name>
              <description>CRC software reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>POLYSIZE</name>
              <description>Polynomial size</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>REV_IN</name>
              <description>Reverse input data</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>REV_OUT</name>
              <description>Reverse output data</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CRC_INIT</name>
              <description>initial value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POL</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CRC_POL</name>
              <description>polynomial</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CTC</name>
      <baseAddress>0x4000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL0</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CKOKIE</name>
              <description>Clock calibration completion interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CKWARNIE</name>
              <description>Clock calibration warning interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EREFIE</name>
              <description>Expected reference signal interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNTEN</name>
              <description>CTC count enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUTOTRIM</name>
              <description>Automatic trim mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWREFPUL</name>
              <description>Software generates synchronous reference signal pulses</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRIMVALUE</name>
              <description>Trim Value</description>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RLVALUE</name>
              <description>CTC counter reload value</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CKLIM</name>
              <description>Clock calibration time base limit</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>REFPSC</name>
              <description>Reference signal source pre division</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Selection of reference signal source</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>REFPOL</name>
              <description>Reference signal source polarity</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CKOKIF</name>
              <description>Clock calibration successful interrupt flag bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CKWARNIF</name>
              <description>Clock calibration warning interrupt flag bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIF</name>
              <description>Error interrupt flag bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EREFIF</name>
              <description>Expected reference interrupt flag bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CKERR</name>
              <description>Clock calibration error bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REFMISS</name>
              <description>Loss of synchronous reference pulse signal</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMERR</name>
              <description>Calibration value error bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REFDIR</name>
              <description>CTC calibration clock counting direction</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REFCAP</name>
              <description>CTC counter capture value</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTC</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>CKOKIC</name>
              <description>CKOKIF interrupt clear bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CKWARNIC</name>
              <description>CKWARNIF interrupt clear bit</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ERRIC</name>
              <description>ERRIF interrupt clear bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EREFIC</name>
              <description>EREFIF interrupt clear bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
