Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DAC</name>
        <description>DAC global Interrupt</description>
        <value>72</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOFF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TEN1</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TSEL1</name>
              <bitRange>[6:3]</bitRange>
            </field>
            <field>
              <name>WAVE1</name>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>MAMP1</name>
              <bitRange>[12:9]</bitRange>
            </field>
            <field>
              <name>DMAEN1</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE1</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DAC1CEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EN2</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BOFF2</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TEN2</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TSEL2</name>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>WAVE2</name>
              <bitRange>[24:23]</bitRange>
            </field>
            <field>
              <name>MAMP2</name>
              <bitRange>[28:25]</bitRange>
            </field>
            <field>
              <name>DMAEN2</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE2</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DAC2CEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIGR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SWTRIG1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWTRIG2</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R1</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R2</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R2</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12RD</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12LD</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[31:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8RD</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR1</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DACC1DOR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR2</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>DACC1DOR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>DMAUDR1</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DMAUDR2</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>INTEREN1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INTEREN2</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
