Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_STDBY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRACE_IOEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRACE_MODE</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DBG_TIM1_STOP</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_TIM2_STOP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_TIM4_STOP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DBG_CAN1_STOP</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DBG_I2C1_SMBUS_TIMEOUT</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_I2C2_SMBUS_TIMEOUT</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DBG_TIM8_STOP</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DBG_TIM5_STOP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DBG_TIM6_STOP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DBG_TIM7_STOP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DBG_TIM12_STOP</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DBG_TIM13_STOP</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DBG_TIM14_STOP</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DBG_TIM9_STOP</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DBG_TIM10_STOP</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DBG_TIM11_STOP</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_I2C3_SMBUS_TIMEOUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_I2C4_SMBUS_TIMEOUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_CAN2_STOP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DBG_TIM15_STOP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBG_TIM17_STOP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DBG_TIM18_STOP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DBG_TIM19_STOP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA1</name>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA1_Channel1</name>
        <description>DMA1 channel 1 global interrupt</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel2</name>
        <description>DMA1 channel 2 global interrupt</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel3</name>
        <description>DMA1 channel 3 global interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel4</name>
        <description>DMA1 channel 4 global interrupt</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel5</name>
        <description>DMA1 channel 5 global interrupt</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel6</name>
        <description>DMA1 channel 6 global interrupt</description>
        <value>16</value>
      </interrupt>
      <registers>
        <register>
          <name>EN</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DMA_EN</name>
              <description>DMA Enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_EN</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CH_EN</name>
              <description>Channel enable</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>CH_EN_WE</name>
              <description>Channel enable register</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLL0</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DST_TR_WIDTH</name>
              <description>Destination Transfer Width</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>SRC_TR_WIDTH</name>
              <description>Source Transfer Width</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination Address Increment</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>SINC</name>
              <description>Source Address Increment</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <description>Destination Burst Transaction Length</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <description>Source Burst Transaction Length</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>TT</name>
              <description>Transfer Type</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLH0</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>BLOCK_TS</name>
              <description>Block Transfer Size.</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGL0</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CH_PRIOR</name>
              <description>Channel Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CH_SUSP</name>
              <description>Channel Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Channel FIFO status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MAX_ABRST</name>
              <description>Maximum AMBA Burst Length.</description>
              <bitRange>[29:20]</bitRange>
            </field>
            <field>
              <name>RELOAD_SRC</name>
              <description>Automatic Source Reload</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>RELOAD_DST</name>
              <description>Automatic Destination Reload</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGH0</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>FIFO_MODE</name>
              <description>FIFO Mode Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROTCTL</name>
              <description>Protection Control</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SRC_PER</name>
              <description>Source hardware interface</description>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination hardware interface</description>
              <bitRange>[13:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SA0</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address for Channel 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DA0</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination Address Register for Channel0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLL1</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DST_TR_WIDTH</name>
              <description>Destination Transfer Width</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>SRC_TR_WIDTH</name>
              <description>Source Transfer Width</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination Address Increment</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>SINC</name>
              <description>Source Address Increment</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <description>Destination Burst Transaction Length</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <description>Source Burst Transaction Length</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>TT</name>
              <description>Transfer Type</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLH1</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>BLOCK_TS</name>
              <description>Block Transfer Size.</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGL1</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>CH_PRIOR</name>
              <description>Channel Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CH_SUSP</name>
              <description>Channel Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Channel FIFO status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MAX_ABRST</name>
              <description>Maximum AMBA Burst Length.</description>
              <bitRange>[29:20]</bitRange>
            </field>
            <field>
              <name>RELOAD_SRC</name>
              <description>Automatic Source Reload</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>RELOAD_DST</name>
              <description>Automatic Destination Reload</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGH1</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>FIFO_MODE</name>
              <description>FIFO Mode Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROTCTL</name>
              <description>Protection Control</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SRC_PER</name>
              <description>Source hardware interface</description>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination hardware interface</description>
              <bitRange>[13:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SA1</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address for Channel 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DA1</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination Address Register for Channel0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLL2</name>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DST_TR_WIDTH</name>
              <description>Destination Transfer Width</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>SRC_TR_WIDTH</name>
              <description>Source Transfer Width</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination Address Increment</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>SINC</name>
              <description>Source Address Increment</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <description>Destination Burst Transaction Length</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <description>Source Burst Transaction Length</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>TT</name>
              <description>Transfer Type</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLH2</name>
          <addressOffset>0xC4</addressOffset>
          <fields>
            <field>
              <name>BLOCK_TS</name>
              <description>Block Transfer Size.</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGL2</name>
          <addressOffset>0xC8</addressOffset>
          <fields>
            <field>
              <name>CH_PRIOR</name>
              <description>Channel Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CH_SUSP</name>
              <description>Channel Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Channel FIFO status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MAX_ABRST</name>
              <description>Maximum AMBA Burst Length.</description>
              <bitRange>[29:20]</bitRange>
            </field>
            <field>
              <name>RELOAD_SRC</name>
              <description>Automatic Source Reload</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>RELOAD_DST</name>
              <description>Automatic Destination Reload</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGH2</name>
          <addressOffset>0xCC</addressOffset>
          <fields>
            <field>
              <name>FIFO_MODE</name>
              <description>FIFO Mode Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROTCTL</name>
              <description>Protection Control</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SRC_PER</name>
              <description>Source hardware interface</description>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination hardware interface</description>
              <bitRange>[13:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SA2</name>
          <addressOffset>0xD0</addressOffset>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address for Channel 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DA2</name>
          <addressOffset>0xD8</addressOffset>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination Address Register for Channel0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
