Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>CH_CTRLL3</name>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DST_TR_WIDTH</name>
              <description>Destination Transfer Width</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>SRC_TR_WIDTH</name>
              <description>Source Transfer Width</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination Address Increment</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>SINC</name>
              <description>Source Address Increment</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <description>Destination Burst Transaction Length</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <description>Source Burst Transaction Length</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>TT</name>
              <description>Transfer Type</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLH3</name>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>BLOCK_TS</name>
              <description>Block Transfer Size.</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGL3</name>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>CH_PRIOR</name>
              <description>Channel Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CH_SUSP</name>
              <description>Channel Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Channel FIFO status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MAX_ABRST</name>
              <description>Maximum AMBA Burst Length.</description>
              <bitRange>[29:20]</bitRange>
            </field>
            <field>
              <name>RELOAD_SRC</name>
              <description>Automatic Source Reload</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>RELOAD_DST</name>
              <description>Automatic Destination Reload</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGH3</name>
          <addressOffset>0x124</addressOffset>
          <fields>
            <field>
              <name>FIFO_MODE</name>
              <description>FIFO Mode Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROTCTL</name>
              <description>Protection Control</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SRC_PER</name>
              <description>Source hardware interface</description>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination hardware interface</description>
              <bitRange>[13:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SA3</name>
          <addressOffset>0x128</addressOffset>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address for Channel 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DA3</name>
          <addressOffset>0x130</addressOffset>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination Address Register for Channel0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLL4</name>
          <addressOffset>0x170</addressOffset>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DST_TR_WIDTH</name>
              <description>Destination Transfer Width</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>SRC_TR_WIDTH</name>
              <description>Source Transfer Width</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination Address Increment</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>SINC</name>
              <description>Source Address Increment</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <description>Destination Burst Transaction Length</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <description>Source Burst Transaction Length</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>TT</name>
              <description>Transfer Type</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLH4</name>
          <addressOffset>0x174</addressOffset>
          <fields>
            <field>
              <name>BLOCK_TS</name>
              <description>Block Transfer Size.</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGL4</name>
          <addressOffset>0x178</addressOffset>
          <fields>
            <field>
              <name>CH_PRIOR</name>
              <description>Channel Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CH_SUSP</name>
              <description>Channel Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Channel FIFO status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MAX_ABRST</name>
              <description>Maximum AMBA Burst Length.</description>
              <bitRange>[29:20]</bitRange>
            </field>
            <field>
              <name>RELOAD_SRC</name>
              <description>Automatic Source Reload</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>RELOAD_DST</name>
              <description>Automatic Destination Reload</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGH4</name>
          <addressOffset>0x17C</addressOffset>
          <fields>
            <field>
              <name>FIFO_MODE</name>
              <description>FIFO Mode Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROTCTL</name>
              <description>Protection Control</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SRC_PER</name>
              <description>Source hardware interface</description>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination hardware interface</description>
              <bitRange>[13:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SA4</name>
          <addressOffset>0x180</addressOffset>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address for Channel 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DA4</name>
          <addressOffset>0x188</addressOffset>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination Address Register for Channel0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLL5</name>
          <addressOffset>0x1C8</addressOffset>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DST_TR_WIDTH</name>
              <description>Destination Transfer Width</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>SRC_TR_WIDTH</name>
              <description>Source Transfer Width</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination Address Increment</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>SINC</name>
              <description>Source Address Increment</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DST_MSIZE</name>
              <description>Destination Burst Transaction Length</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SRC_MSIZE</name>
              <description>Source Burst Transaction Length</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>TT</name>
              <description>Transfer Type</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRLH5</name>
          <addressOffset>0x1CC</addressOffset>
          <fields>
            <field>
              <name>BLOCK_TS</name>
              <description>Block Transfer Size.</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGL5</name>
          <addressOffset>0x1D0</addressOffset>
          <fields>
            <field>
              <name>CH_PRIOR</name>
              <description>Channel Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CH_SUSP</name>
              <description>Channel Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Channel FIFO status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_SEL_DST</name>
              <description>Destination Software or Hardware Handshaking Select</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HS_SEL_SRC</name>
              <description>Source Software or Hardware Handshaking Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DST_HS_POL</name>
              <description>Destination Handshaking Interface Polarity</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRC_HS_POL</name>
              <description>Source Handshaking Interface Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MAX_ABRST</name>
              <description>Maximum AMBA Burst Length.</description>
              <bitRange>[29:20]</bitRange>
            </field>
            <field>
              <name>RELOAD_SRC</name>
              <description>Automatic Source Reload</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>RELOAD_DST</name>
              <description>Automatic Destination Reload</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CFGH5</name>
          <addressOffset>0x1D4</addressOffset>
          <fields>
            <field>
              <name>FIFO_MODE</name>
              <description>FIFO Mode Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROTCTL</name>
              <description>Protection Control</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SRC_PER</name>
              <description>Source hardware interface</description>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination hardware interface</description>
              <bitRange>[13:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SA5</name>
          <addressOffset>0x1D8</addressOffset>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address for Channel 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DA5</name>
          <addressOffset>0x1E0</addressOffset>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination Address Register for Channel0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWHALFBLOCK</name>
          <addressOffset>0x2A0</addressOffset>
          <fields>
            <field>
              <name>RAW</name>
              <description>Raw Status for IntHalfBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSHALFBLOCK</name>
          <addressOffset>0x2A8</addressOffset>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status for IntHalfBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKHALFBLOCK</name>
          <addressOffset>0x2B0</addressOffset>
          <fields>
            <field>
              <name>INT_MASK</name>
              <description>Mask for IntHalfBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARHALFBLOCK</name>
          <addressOffset>0x2B8</addressOffset>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear for IntHalfBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWTFR</name>
          <addressOffset>0x2C0</addressOffset>
          <fields>
            <field>
              <name>RAW</name>
              <description>Raw Status for IntTfr Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWBLOCK</name>
          <addressOffset>0x2C8</addressOffset>
          <fields>
            <field>
              <name>RAW</name>
              <description>Raw Status for IntBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWSRCTRAN</name>
          <addressOffset>0x2D0</addressOffset>
          <fields>
            <field>
              <name>RAW</name>
              <description>Raw Status for IntSrcTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWDSTTRAN</name>
          <addressOffset>0x2D8</addressOffset>
          <fields>
            <field>
              <name>RAW</name>
              <description>Raw Status for IntDstTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWERR</name>
          <addressOffset>0x2E0</addressOffset>
          <fields>
            <field>
              <name>RAW</name>
              <description>Raw Status for IntErr Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSTFR</name>
          <addressOffset>0x2E8</addressOffset>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status for IntTfr Interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSBLOCK</name>
          <addressOffset>0x2F0</addressOffset>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status for IntBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSSRCTRAN</name>
          <addressOffset>0x2F8</addressOffset>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status for IntSrcTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSDSTTRAN</name>
          <addressOffset>0x300</addressOffset>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status for IntDstTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSERR</name>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status for IntErr Interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKTFR</name>
          <addressOffset>0x310</addressOffset>
          <fields>
            <field>
              <name>INT_MASK</name>
              <description>Mask for IntTfr Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKBLOCK</name>
          <addressOffset>0x318</addressOffset>
          <fields>
            <field>
              <name>INT_MASK</name>
              <description>Mask for IntBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKSRCTRAN</name>
          <addressOffset>0x320</addressOffset>
          <fields>
            <field>
              <name>INT_MASK</name>
              <description>Mask for IntSrcTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
