Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>MASKDSTTRAN</name>
          <addressOffset>0x328</addressOffset>
          <fields>
            <field>
              <name>INT_MASK</name>
              <description>Mask for IntDstTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKERR</name>
          <addressOffset>0x330</addressOffset>
          <fields>
            <field>
              <name>INT_MASK</name>
              <description>Mask for IntErr Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>INT_MASK_WE</name>
              <description>Interrupt Mask Write Enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARTFR</name>
          <addressOffset>0x338</addressOffset>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear for IntTfr Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARBLOCK</name>
          <addressOffset>0x340</addressOffset>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear for IntBlock Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARSRCTRAN</name>
          <addressOffset>0x348</addressOffset>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear for IntSrcTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARDSTTRAN</name>
          <addressOffset>0x350</addressOffset>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear for IntDstTran Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARERR</name>
          <addressOffset>0x358</addressOffset>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear for IntErr Interrupt</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSINT</name>
          <addressOffset>0x360</addressOffset>
          <fields>
            <field>
              <name>TFR</name>
              <description>OR of the contents of StatusTfr</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BLOCK</name>
              <description>OR of the contents of StatusBlock</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SRCT</name>
              <description>OR of the contents of StatusSrcTran</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DSTT</name>
              <description>OR of the contents of StatusDstTran</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR</name>
              <description>OR of the contents of StatusErr</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HALFBLOCK</name>
              <description>OR of the contents of StatusHalfBlock</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQSRC</name>
          <addressOffset>0x368</addressOffset>
          <fields>
            <field>
              <name>SRC_REQ</name>
              <description>Source Software Transaction Request</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SRC_REQ_WE</name>
              <description>Source Software Transaction Request write enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REQDST</name>
          <addressOffset>0x370</addressOffset>
          <fields>
            <field>
              <name>DST_REQ</name>
              <description>Destination Software Transaction Request</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DST_REQ_WE</name>
              <description>Destination Software Transaction Request write enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SGLRQSRC</name>
          <addressOffset>0x378</addressOffset>
          <fields>
            <field>
              <name>SRC_SGLREQ</name>
              <description>Source Single Transaction Request</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SRC_SGLREQ_WE</name>
              <description>Source Single Transaction Request write enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SGLRQDST</name>
          <addressOffset>0x380</addressOffset>
          <fields>
            <field>
              <name>DST_SGLREQ</name>
              <description>Destination Single Transaction Request</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DST_SGLREQ_WE</name>
              <description>Destination Single Transaction Request write enable</description>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
