Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DMA1">
      <name>DMA2</name>
      <baseAddress>0x40020400</baseAddress>
      <interrupt>
        <name>DMA2_Channel6</name>
        <description>DMA2 channel 6 global interrupt</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>DMA2_Channel1</name>
        <description>DMA2 channel 1 global interrupt</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>DMA2_Channel2</name>
        <description>DMA2 channel 2 global interrupt</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>DMA2_Channel3</name>
        <description>DMA2 channel 3 global interrupt</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>DMA2_Channel4_5</name>
        <description>DMA2 channel 4_5 global interrupt</description>
        <value>59</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ESMC</name>
      <baseAddress>0xA0001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ESMC</name>
        <description>ESMC global interrupt</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SOFTRST</name>
              <description>Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>2QSPI</name>
              <description>Dual Flash Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>dma en</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>GIE</name>
              <description>globle interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>XIPEN</name>
              <description>xip mode en</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SPIEN</name>
              <description>spi en</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CPHA</name>
              <description>clock phase</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>clock polarity</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXFIFO_CLR</name>
              <description>txfifo clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXFIFO_CLR</name>
              <description>rxfifo clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>XSPI_DUAL_LAT_OFF</name>
              <description>xspi dual latency off enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>HOLD</name>
              <description>setup/hold time</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>HIGH</name>
              <description>high time</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUD</name>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BAUD</name>
              <description>baud set</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SFCR</name>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SFCR0</name>
              <description>Command Only</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCR</name>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SPIMODE</name>
              <description>spi mode</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SENM</name>
              <description>send mode enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MULTICMD</name>
              <description>muti command</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MULTIADDR</name>
              <description>muti address</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DDRCMD</name>
              <description>ddr command</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DDRADDR</name>
              <description>ddr address</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DDRDATA</name>
              <description>ddr data</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DUMMY</name>
              <description>dummy cycyle set</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>NO_CMD</name>
              <description>no command</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>REC</name>
              <description>receive enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR8BIT</name>
              <description>8bit address</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDR16BIT</name>
              <description>16bit address</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADDR32BIT</name>
              <description>32bit address</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NO_ADDR</name>
              <description>no address enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>XSPI_RWDS</name>
              <description>xSPI RWDS enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMD_EXT</name>
              <description>command extend enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NO_DATA</name>
              <description>no data enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR24</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>INS1</name>
              <description>command1</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>ADDR0</name>
              <description>address0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ADDR1</name>
              <description>address1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADDR2</name>
              <description>address2</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR32</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>ADDR3</name>
              <description>address3</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MREG</name>
              <description>Mode register</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>SSXO</name>
              <description>Slave select enable</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>SS_CLR</name>
              <description>Slave select clear</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SS_SET</name>
              <description>Slave select set</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DATA0</name>
              <description>data0</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DATA1</name>
              <description>data1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATA2</name>
              <description>data2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>DATA3</name>
              <description>data3</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SSACTIVE</name>
              <description>slave select active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBUSY</name>
              <description>rx busy state</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBUSY</name>
              <description>tx busy state</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XIPBUSY</name>
              <description>xip busy state</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_STATE</name>
              <description>idle state</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOOV</name>
              <description>txfifo overflow state</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAWAIT</name>
              <description>data wait</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPIF</name>
              <description>spi interrupt flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RWDSI_ND</name>
              <description>rwdsi not detect</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XSPI_DUAL_LATENCY</name>
              <description>xspi dual latency flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXSTAT</name>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RXSTAT</name>
              <description>rx state</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFR1</name>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMDIF</name>
              <description>command done interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXFIFONEIF</name>
              <description>rxfifo not empty interrupt flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFOHFIF</name>
              <description>rxfifo half full interrupt flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFOFIF</name>
              <description>rxfifo full interrupt flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLEDONEIF</name>
              <description>idle interrupt flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAWAITIF</name>
              <description>data wait interrupt flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFOWIF</name>
              <description>rx fifo word interrupt flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDRDONEIF</name>
              <description>address done interrupt flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER1</name>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMDIE</name>
              <description>command done interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXFIFONEIE</name>
              <description>rx fifo not empty interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFIFOHFIE</name>
              <description>rx fifo half interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXFIFOFIE</name>
              <description>rx fifo full interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEDONEIE</name>
              <description>idle interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DATAWAITIE</name>
              <description>busy interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXFIFOWIE</name>
              <description>rx fifo word interrupt enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADDRDONEIE</name>
              <description>address done interrupt enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFR2</name>
          <addressOffset>0x1A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XIPRDINSTRSETIF</name>
              <description>xip read instr set interrupt flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOEIF</name>
              <description>tx fifo empty interrupt flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOHEIF</name>
              <description>tx fifo half empty interrupt flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOFIF</name>
              <description>tx fifo full interrupt flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFOOVIF</name>
              <description>tx fifo overflow interrupt flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXWORDOVIF</name>
              <description>txfifo word interrupt flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>XIPWEINSTRSETIF</name>
              <description>xip write instr set interrupt flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTOUTIF</name>
              <description>rx timeout interrupt flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER2</name>
          <addressOffset>0x1B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXFIFOEIE</name>
              <description>tx fifo empty interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXFIFOHEIE</name>
              <description>tx fifo half full interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXFIFOFIE</name>
              <description>tx fifo full interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXFIFOOVIE</name>
              <description>tx fifo overflow interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXWORDOVIE</name>
              <description>txfifo word interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STRR</name>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SMP</name>
              <description>sample</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSFCR</name>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XINS</name>
              <description>XIP read command</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSOCR</name>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SPI_MODE</name>
              <description>xip read spi mode</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SEND_M</name>
              <description>xip read send mode enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MULTICMD</name>
              <description>xip read muti command</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MULTIADDR</name>
              <description>xip read muti address</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DDRCMD</name>
              <description>xip read ddr command</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DDRADDR</name>
              <description>xip read ddr address</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DDRDATA</name>
              <description>xip read ddr data</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XDCR</name>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XDUMMY</name>
              <description>xip read dummy cycle set</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>NO_CMD</name>
              <description>xip read no command</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
