Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>XCR3</name>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR8BIT</name>
              <description>xip read 8bit address</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDR16BIT</name>
              <description>xip read 16bit address</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADDR32BIT</name>
              <description>xip read 32bit address</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NO_ADDR</name>
              <description>xip read no address enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>XSPI_RWDS</name>
              <description>xip read xSPI RWDS enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMD_EXT</name>
              <description>xip read command extend enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODE</name>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XMODE</name>
              <description>xip send modereg</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODE_WE</name>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XMODE_WE</name>
              <description>xip send modereg_we</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSSOCR</name>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SSXO</name>
              <description>xip read Slave select enable</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SS_CLR_RQ</name>
              <description>xip read Slave select clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSSOCR_WE</name>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SSXO</name>
              <description>xip write Slave select enable</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SS_CLR_RQ</name>
              <description>xip write Slave select clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSFCR_WE</name>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XINS_WE</name>
              <description>XIP write command</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSOCR_WE</name>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SPI_MODE</name>
              <description>xip write spi mode</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SEND_M</name>
              <description>xip write send mode enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MULTICMD</name>
              <description>xip write muti command</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MULTIADDR</name>
              <description>xip write muti address</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DDRCMD</name>
              <description>xip write ddr command</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DDRADDR</name>
              <description>xip write ddr address</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DDRDATA</name>
              <description>xip write ddr data</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XDCR_WE</name>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XDUMMY</name>
              <description>xip write dummy cycle set</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>NO_CMD</name>
              <description>xip write no command</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XCR3_WE</name>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR8BIT</name>
              <description>xip write 8bit address</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDR16BIT</name>
              <description>xip write 16bit address</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADDR32BIT</name>
              <description>xip write 32bit address</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NO_ADDR</name>
              <description>xip write no address enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>XSPI_RWDS</name>
              <description>xip write xSPI RWDS enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMD_EXT</name>
              <description>xip write command extend enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>BCR</name>
              <description>bit control register</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTOUT</name>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RXTOUT</name>
              <description>rx timeout</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XSTRR</name>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>XSMP</name>
              <description>xip sample sample</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
