Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETHERNET_DMA</name>
      <description>Ethernet: DMA controller operation</description>
      <baseAddress>0x480C1000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMABMR</name>
          <description>Ethernet DMA bus mode register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SR</name>
              <description>Software reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DA</name>
              <description>DMA Arbitration</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DSL</name>
              <description>Descriptor skip length</description>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>PBL</name>
              <description>Programmable burst length</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>RTPR</name>
              <description>Rx Tx priority ratio</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>FB</name>
              <description>Fixed burst</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RDP</name>
              <description>Rx DMA PBL</description>
              <bitRange>[22:17]</bitRange>
            </field>
            <field>
              <name>USP</name>
              <description>Use separate PBL</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FPM</name>
              <description>4xPBL mode</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AAB</name>
              <description>Address-aligned beats</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATPDR</name>
          <description>Ethernet DMA transmit poll demand register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>TPD</name>
              <description>Transmit poll demand</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARPDR</name>
          <description>EHERNET DMA receive poll demand register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RPD</name>
              <description>Receive poll demand</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARDLAR</name>
          <description>Ethernet DMA receive descriptor list address register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SRL</name>
              <description>Start of receive list</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATDLAR</name>
          <description>Ethernet DMA transmit descriptor list address register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>STL</name>
              <description>Start of transmit list</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASR</name>
          <description>Ethernet DMA status register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>TS</name>
              <description>Transmit status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TPSS</name>
              <description>Transmit process stopped status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TBUS</name>
              <description>Transmit buffer unavailable status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TJTS</name>
              <description>Transmit jabber timeout status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ROS</name>
              <description>Receive overflow status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TUS</name>
              <description>Transmit underflow status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RS</name>
              <description>Receive status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RBUS</name>
              <description>Receive buffer unavailable status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RPSS</name>
              <description>Receive process stopped status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWTS</name>
              <description>Receive watchdog timeout status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ETS</name>
              <description>Early transmit status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FBES</name>
              <description>Fatal bus error status</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ERS</name>
              <description>Early receive status</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AIS</name>
              <description>Abnormal interrupt summary</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NIS</name>
              <description>Normal interrupt summary</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RPS</name>
              <description>Receive process state</description>
              <bitRange>[19:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TPS</name>
              <description>Transmit process state</description>
              <bitRange>[22:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EBS</name>
              <description>Error bits status</description>
              <bitRange>[25:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCS</name>
              <description>MMC status</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PMTS</name>
              <description>PMT status</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTS</name>
              <description>Time stamp trigger status</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAOMR</name>
          <description>Ethernet DMA operation mode register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SR</name>
              <description>SR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OSF</name>
              <description>OSF</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>FUGF</name>
              <description>FUGF</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FEF</name>
              <description>FEF</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ST</name>
              <description>ST</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TTC</name>
              <description>TTC</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>FTF</name>
              <description>FTF</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TSF</name>
              <description>TSF</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DFRF</name>
              <description>DFRF</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>RSF</name>
              <description>RSF</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DTCEFD</name>
              <description>DTCEFD</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIER</name>
          <description>Ethernet DMA interrupt enable register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>TIE</name>
              <description>Transmit interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TPSIE</name>
              <description>Transmit process stopped interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TBUIE</name>
              <description>Transmit buffer unavailable interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TJTIE</name>
              <description>Transmit jabber timeout interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ROIE</name>
              <description>Overflow interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TUIE</name>
              <description>Underflow interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RIE</name>
              <description>Receive interrupt enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RBUIE</name>
              <description>Receive buffer unavailable interrupt enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RPSIE</name>
              <description>Receive process stopped interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RWTIE</name>
              <description>receive watchdog timeout interrupt enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ETIE</name>
              <description>Early transmit interrupt enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FBEIE</name>
              <description>Fatal bus error interrupt enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ERIE</name>
              <description>Early receive interrupt enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AISE</name>
              <description>Abnormal interrupt summary enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NISE</name>
              <description>Normal interrupt summary enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMFBOCR</name>
          <description>Ethernet DMA missed frame and buffer overflow counter register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>MFC</name>
              <description>Missed frames by the controller</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OMFC</name>
              <description>Overflow bit for missed frame counter</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MFA</name>
              <description>Missed frames by the application</description>
              <bitRange>[27:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OFOC</name>
              <description>Overflow bit for FIFO overflow counter</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHTDR</name>
          <description>Ethernet DMA current host transmit descriptor register</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>HTDAP</name>
              <description>Host transmit descriptor address pointer</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHRDR</name>
          <description>Ethernet DMA current host receive descriptor register</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>HRDAP</name>
              <description>Host receive descriptor address pointer</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHTBAR</name>
          <description>Ethernet DMA current host transmit buffer address register</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>HTBAP</name>
              <description>Host transmit buffer address pointer</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHRBAR</name>
          <description>Ethernet DMA current host receive buffer address register</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>HRBAP</name>
              <description>Host receive buffer address pointer</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
