Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETHERNET_MAC</name>
      <description>Ethernet: media access control</description>
      <baseAddress>0x480C0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETH</name>
        <description>Ethernet global interrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>ETH_WKUP</name>
        <description>Ethernet Wakeup through EXTI line
        interrupt</description>
        <value>68</value>
      </interrupt>
      <registers>
        <register>
          <name>MACCR</name>
          <description>Ethernet MAC configuration register (ETH_MACCR)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DC</name>
              <description>Deferral check</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BL</name>
              <description>Back-off limit</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>APCS</name>
              <description>Automatic pad/CRC stripping</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RD</name>
              <description>Retry disable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IPCO</name>
              <description>IPv4 checksum offload</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DM</name>
              <description>Duplex mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LM</name>
              <description>Loopback mode</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ROD</name>
              <description>Receive own disable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FES</name>
              <description>Fast Ethernet speed</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSD</name>
              <description>Carrier sense disable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IFG</name>
              <description>Interframe gap</description>
              <bitRange>[19:17]</bitRange>
            </field>
            <field>
              <name>JD</name>
              <description>Jabber disable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>WD</name>
              <description>Watchdog disable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACFFR</name>
          <description>Ethernet MAC frame filter register (ETH_MACCFFR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PM</name>
              <description>Promiscuous mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HU</name>
              <description>Hash unicast</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HM</name>
              <description>Hash multicast</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DAIF</name>
              <description>Destination address inverse filtering</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PAM</name>
              <description>Pass all multicast</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BFD</name>
              <description>Broadcast frames disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass control frames</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>SAIF</name>
              <description>Source address inverse filtering</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SAF</name>
              <description>Source address filter</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HPF</name>
              <description>Hash or perfect filter</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RA</name>
              <description>Receive all</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACHTHR</name>
          <description>Ethernet MAC hash table high register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>HTH</name>
              <description>Hash table high</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACHTLR</name>
          <description>Ethernet MAC hash table low register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>HTL</name>
              <description>Hash table low</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACMIIAR</name>
          <description>Ethernet MAC MII address register (ETH_MACMIIAR)</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>MB</name>
              <description>MII busy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MW</name>
              <description>MII write</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CR</name>
              <description>Clock range</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>MR</name>
              <description>MII register</description>
              <bitRange>[10:6]</bitRange>
            </field>
            <field>
              <name>PA</name>
              <description>PHY address</description>
              <bitRange>[15:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACMIIDR</name>
          <description>Ethernet MAC MII data register (ETH_MACMIIDR)</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MD</name>
              <description>MII data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACFCR</name>
          <description>Ethernet MAC flow control register (ETH_MACFCR)</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>FCB_BPA</name>
              <description>Flow control busy/back pressure activate</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TFCE</name>
              <description>Transmit flow control enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RFCE</name>
              <description>Receive flow control enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UPFD</name>
              <description>Unicast pause frame detect</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause low threshold</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>ZQPD</name>
              <description>Zero-quanta pause disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PT</name>
              <description>Pass control frames</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACVLANTR</name>
          <description>Ethernet MAC VLAN tag register (ETH_MACVLANTR)</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>VLANTI</name>
              <description>VLAN tag identifier (for receive frames)</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VLANTC</name>
              <description>12-bit VLAN tag comparison</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPMTCSR</name>
          <description>Ethernet MAC PMT control and status register (ETH_MACPMTCSR)</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PD</name>
              <description>Power down</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MPE</name>
              <description>Magic Packet enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WFE</name>
              <description>Wakeup frame enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MPR</name>
              <description>Magic packet received</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>WFR</name>
              <description>Wakeup frame received</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GU</name>
              <description>Global unicast</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WFFRPR</name>
              <description>Wakeup frame filter register pointer reset</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSR</name>
          <description>Ethernet MAC interrupt status register (ETH_MACSR)</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PMTS</name>
              <description>PMT status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MMCS</name>
              <description>MMC status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MMCRS</name>
              <description>MMC receive status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MMCTS</name>
              <description>MMC transmit status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TSTS</name>
              <description>Time stamp trigger status</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACIMR</name>
          <description>Ethernet MAC interrupt mask register (ETH_MACIMR)</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>PMTIM</name>
              <description>PMT interrupt mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TSTIM</name>
              <description>Time stamp trigger interrupt mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA0HR</name>
          <description>Ethernet MAC address 0 high register (ETH_MACA0HR)</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>MACA0H</name>
              <description>MAC address0 high</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>MO</name>
              <description>Always 1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA0LR</name>
          <description>Ethernet MAC address 0 low register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>MACA0L</name>
              <description>MAC address0 low</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA1HR</name>
          <description>Ethernet MAC address 1 high register (ETH_MACA1HR)</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>MACA1H</name>
              <description>MAC address1 high</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask byte control</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>SA</name>
              <description>Source address</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AE</name>
              <description>Address enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA1LR</name>
          <description>Ethernet MAC address1 low register</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>MACA1L</name>
              <description>MAC address1 low</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA2HR</name>
          <description>Ethernet MAC address 2 high register (ETH_MACA2HR)</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>ETH_MACA2HR</name>
              <description>Ethernet MAC address 2 high register</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask byte control</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>SA</name>
              <description>Source address</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AE</name>
              <description>Address enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA2LR</name>
          <description>Ethernet MAC address 2 low register</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>MACA2L</name>
              <description>MAC address2 low</description>
              <bitRange>[30:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA3HR</name>
          <description>Ethernet MAC address 3 high register (ETH_MACA3HR)</description>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>MACA3H</name>
              <description>MAC address3 high</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask byte control</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>SA</name>
              <description>Source address</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AE</name>
              <description>Address enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA3LR</name>
          <description>Ethernet MAC address 3 low register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>MBCA3L</name>
              <description>MAC address3 low</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
