Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETHERNET_MMC</name>
      <description>Ethernet: MAC management counters</description>
      <baseAddress>0x480C0100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MMCCR</name>
          <description>Ethernet MMC control register (ETH_MMCCR)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CR</name>
              <description>Counter reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSR</name>
              <description>Counter stop rollover</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ROR</name>
              <description>Reset on read</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MCF</name>
              <description>MMC counter freeze</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRIR</name>
          <description>Ethernet MMC receive interrupt register (ETH_MMCRIR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RFCES</name>
              <description>Received frames CRC error status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RFAES</name>
              <description>Received frames alignment error status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RGUFS</name>
              <description>Received Good Unicast Frames Status</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTIR</name>
          <description>Ethernet MMC transmit interrupt register (ETH_MMCTIR)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>TGFSCS</name>
              <description>Transmitted good frames single collision status</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TGFMSCS</name>
              <description>Transmitted good frames more single collision status</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TGFS</name>
              <description>Transmitted good frames status</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRIMR</name>
          <description>Ethernet MMC receive interrupt mask register (ETH_MMCRIMR)</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>RFCEM</name>
              <description>Received frame CRC error mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RFAEM</name>
              <description>Received frames alignment error mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RGUFM</name>
              <description>Received good unicast frames mask</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTIMR</name>
          <description>Ethernet MMC transmit interrupt mask register (ETH_MMCTIMR)</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>TGFSCM</name>
              <description>Transmitted good frames single collision mask</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TGFMSCM</name>
              <description>Transmitted good frames more single collision mask</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TGFM</name>
              <description>Transmitted good frames mask</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFSCCR</name>
          <description>Ethernet MMC transmitted good frames after a single collision counter</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>TGFSCC</name>
              <description>Transmitted good frames after a single collision counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFMSCCR</name>
          <description>Ethernet MMC transmitted good frames after more than a single collision</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>TGFMSCC</name>
              <description>Transmitted good frames after more than a single collision counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFCR</name>
          <description>Ethernet MMC transmitted good frames counter register</description>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>TGFC</name>
              <description>Transmitted good frames counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRFCECR</name>
          <description>Ethernet MMC received frames with CRC error counter register</description>
          <addressOffset>0x94</addressOffset>
          <fields>
            <field>
              <name>RFCFC</name>
              <description>Received frames with CRC error counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRFAECR</name>
          <description>Ethernet MMC received frames with alignment error counter register</description>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>RFAEC</name>
              <description>Received frames with alignment error counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRGUFCR</name>
          <description>MMC received good unicast frames counter register</description>
          <addressOffset>0xC4</addressOffset>
          <fields>
            <field>
              <name>RGUFC</name>
              <description>Received good unicast frames counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
