Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETHERNET_PTP</name>
      <description>Ethernet: Precision time protocol</description>
      <baseAddress>0x480C0700</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PTPTSCR</name>
          <description>Ethernet PTP time stamp control register (ETH_PTPTSCR)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TSE</name>
              <description>Time stamp enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TSFCU</name>
              <description>Time stamp fine or coarse update</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSSTI</name>
              <description>Time stamp system time initialize</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TSSTU</name>
              <description>Time stamp system time update</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TSITE</name>
              <description>Time stamp interrupt trigger enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TSARU</name>
              <description>Time stamp addend register update</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPSSIR</name>
          <description>Ethernet PTP subsecond increment register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>STSSI</name>
              <description>System time subsecond increment</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSHR</name>
          <description>Ethernet PTP time stamp high register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>STS</name>
              <description>System time second</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSLR</name>
          <description>Ethernet PTP time stamp low register (ETH_PTPTSLR)</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>STSS</name>
              <description>System time subseconds</description>
              <bitRange>[30:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STPNS</name>
              <description>System time positive or negative sign</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSHUR</name>
          <description>Ethernet PTP time stamp high update register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>TSUS</name>
              <description>Time stamp update second</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSLUR</name>
          <description>Ethernet PTP time stamp low update register (ETH_PTPTSLUR)</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>TSUSS</name>
              <description>Time stamp update subseconds</description>
              <bitRange>[30:0]</bitRange>
            </field>
            <field>
              <name>TSUPNS</name>
              <description>Time stamp update positive or negative sign</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSAR</name>
          <description>Ethernet PTP time stamp addend register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>TSA</name>
              <description>Time stamp addend</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTTHR</name>
          <description>Ethernet PTP target time high register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>TTSH</name>
              <description>Target time stamp high</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTTLR</name>
          <description>Ethernet PTP target time low register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>TTSL</name>
              <description>Target time stamp low</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <baseAddress>0x40010400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EXTI0</name>
        <description>EXTI Line0 interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI1</name>
        <description>EXTI Line1 interrupt</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>EXTI2</name>
        <description>EXTI Line2 interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>EXTI3</name>
        <description>EXTI Line3 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>EXTI4</name>
        <description>EXTI Line4 interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>OTG1_FS_WKUP</name>
        <description>USB1 OTG FS wakeup via EXTI interrupt</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>EXTI9_5</name>
        <description>EXTI Line9_5 interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>EXTI15_10</name>
        <description>EXTI Line15_10 interrupt</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>RTC_Alarm</name>
        <description>RTC_Alarm EXTI interrupt</description>
        <value>41</value>
      </interrupt>
      <registers>
        <register>
          <name>IMR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>IMR0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IMR1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IMR2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IMR3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IMR4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IMR5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IMR6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IMR7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IMR8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IMR9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IMR10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IMR11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IMR12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IMR13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IMR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IMR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IMR16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IMR17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IMR18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IMR19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IMR20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IMR21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>IMR22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IMR23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IMR24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IMR25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IMR26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>IMR27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>IMR28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IMR29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IMR30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IMR31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR1</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>EMR0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMR1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMR2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMR3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMR4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMR5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMR6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMR7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMR8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMR9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMR10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMR11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EMR12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EMR13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMR16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMR17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EMR18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EMR19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EMR20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EMR21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EMR22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EMR23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EMR24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMR25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMR26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EMR27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EMR28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EMR29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EMR30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EMR31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RTSR0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RTSR1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTSR2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTSR3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RTSR4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RTSR5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTSR6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTSR7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTSR8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RTSR9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RTSR10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RTSR11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RTSR12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RTSR13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RTSR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTSR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RTSR16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RTSR17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RTSR18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RTSR19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RTSR20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RTSR21</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>FTSR0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FTSR1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FTSR2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FTSR3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FTSR4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FTSR5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FTSR6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FTSR7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FTSR8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FTSR9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FTSR10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FTSR11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FTSR12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FTSR13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FTSR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FTSR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FTSR16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FTSR17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>FTSR18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FTSR19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FTSR20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>FTSR21</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>SWIER0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWIER1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWIER2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWIER3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SWIER4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWIER5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWIER6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWIER7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SWIER8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SWIER9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SWIER10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SWIER11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SWIER12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SWIER13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SWIER14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SWIER15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SWIER16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SWIER17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWIER18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SWIER19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWIER20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SWIER21</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
