Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>TXBAR</name>
          <addressOffset>0xD0</addressOffset>
          <fields>
            <field>
              <name>AR0</name>
              <description>Add Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AR1</name>
              <description>Add Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AR2</name>
              <description>Add Request</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AR3</name>
              <description>Add Request</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AR4</name>
              <description>Add Request</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AR5</name>
              <description>Add Request</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AR6</name>
              <description>Add Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AR7</name>
              <description>Add Request</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AR8</name>
              <description>Add Request</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AR9</name>
              <description>Add Request</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AR10</name>
              <description>Add Request</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AR11</name>
              <description>Add Request</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AR12</name>
              <description>Add Request</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AR13</name>
              <description>Add Request</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AR14</name>
              <description>Add Request</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AR15</name>
              <description>Add Request</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AR16</name>
              <description>Add Request</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AR17</name>
              <description>Add Request</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>AR18</name>
              <description>Add Request</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>AR19</name>
              <description>Add Request</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>AR20</name>
              <description>Add Request</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>AR21</name>
              <description>Add Request</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>AR22</name>
              <description>Add Request</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AR23</name>
              <description>Add Request</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AR24</name>
              <description>Add Request</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AR25</name>
              <description>Add Request</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>AR26</name>
              <description>Add Request</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>AR27</name>
              <description>Add Request</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AR28</name>
              <description>Add Request</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>AR29</name>
              <description>Add Request</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AR30</name>
              <description>Add Request</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AR31</name>
              <description>Add Request</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCR</name>
          <addressOffset>0xD4</addressOffset>
          <fields>
            <field>
              <name>CR0</name>
              <description>Cancellation Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CR1</name>
              <description>Cancellation Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CR2</name>
              <description>Cancellation Request</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CR3</name>
              <description>Cancellation Request</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CR4</name>
              <description>Cancellation Request</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CR5</name>
              <description>Cancellation Request</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CR6</name>
              <description>Cancellation Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CR7</name>
              <description>Cancellation Request</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CR8</name>
              <description>Cancellation Request</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CR9</name>
              <description>Cancellation Request</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CR10</name>
              <description>Cancellation Request</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CR11</name>
              <description>Cancellation Request</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CR12</name>
              <description>Cancellation Request</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CR13</name>
              <description>Cancellation Request</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CR14</name>
              <description>Cancellation Request</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CR15</name>
              <description>Cancellation Request</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CR16</name>
              <description>Cancellation Request</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CR17</name>
              <description>Cancellation Request</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CR18</name>
              <description>Cancellation Request</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CR19</name>
              <description>Cancellation Request</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CR20</name>
              <description>Cancellation Request</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CR21</name>
              <description>Cancellation Request</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CR22</name>
              <description>Cancellation Request</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CR23</name>
              <description>Cancellation Request</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CR24</name>
              <description>Cancellation Request</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CR25</name>
              <description>Cancellation Request</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CR26</name>
              <description>Cancellation Request</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CR27</name>
              <description>Cancellation Request</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CR28</name>
              <description>Cancellation Request</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CR29</name>
              <description>Cancellation Request</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CR30</name>
              <description>Cancellation Request</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CR31</name>
              <description>Cancellation Request</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBTO</name>
          <addressOffset>0xD8</addressOffset>
          <fields>
            <field>
              <name>TO0</name>
              <description>Transmission Occurred</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO1</name>
              <description>Transmission Occurred</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2</name>
              <description>Transmission Occurred</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3</name>
              <description>Transmission Occurred</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO4</name>
              <description>Transmission Occurred</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO5</name>
              <description>Transmission Occurred</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO6</name>
              <description>Transmission Occurred</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO7</name>
              <description>Transmission Occurred</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO8</name>
              <description>Transmission Occurred</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO9</name>
              <description>Transmission Occurred</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO10</name>
              <description>Transmission Occurred</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO11</name>
              <description>Transmission Occurred</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO12</name>
              <description>Transmission Occurred</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO13</name>
              <description>Transmission Occurred</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO14</name>
              <description>Transmission Occurred</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO15</name>
              <description>Transmission Occurred</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO16</name>
              <description>Transmission Occurred</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO17</name>
              <description>Transmission Occurred</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO18</name>
              <description>Transmission Occurred</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO19</name>
              <description>Transmission Occurred</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO20</name>
              <description>Transmission Occurred</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO21</name>
              <description>Transmission Occurred</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO22</name>
              <description>Transmission Occurred</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO23</name>
              <description>Transmission Occurred</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO24</name>
              <description>Transmission Occurred</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO25</name>
              <description>Transmission Occurred</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO26</name>
              <description>Transmission Occurred</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO27</name>
              <description>Transmission Occurred</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO28</name>
              <description>Transmission Occurred</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO29</name>
              <description>Transmission Occurred</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO30</name>
              <description>Transmission Occurred</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TO31</name>
              <description>Transmission Occurred</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
