Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOB</name>
      <baseAddress>0x48000400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODER0</name>
              <description>GPIOB0 MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MODER1</name>
              <description>GPIOB1 MODE</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MODER2</name>
              <description>GPIOB2 MODE</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MODER3</name>
              <description>GPIOB3 MODE</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODER4</name>
              <description>GPIOB4 MODE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MODER5</name>
              <description>GPIOB5 MODE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MODER6</name>
              <description>GPIOB6 MODE</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MODER7</name>
              <description>GPIOB7 MODE</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MODER8</name>
              <description>GPIOB8 MODE</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MODER9</name>
              <description>GPIOB9 MODE</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MODER10</name>
              <description>GPIOB10 MODE</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MODER11</name>
              <description>GPIOB11 MODE</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MODER12</name>
              <description>GPIOB12 MODE</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MODER13</name>
              <description>GPIOB13 MODE</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MODER14</name>
              <description>GPIOB14 MODE</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MODER15</name>
              <description>GPIOB15 MODE</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OT0</name>
              <description>GPIOB0 Output type</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OT1</name>
              <description>GPIOB1 Output type</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OT2</name>
              <description>GPIOB2 Output type</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OT3</name>
              <description>GPIOB3 Output type</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OT4</name>
              <description>GPIOB4 Output type</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OT5</name>
              <description>GPIOB5 Output type</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OT6</name>
              <description>GPIOB6 Output type</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OT7</name>
              <description>GPIOB7 Output type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OT8</name>
              <description>GPIOB8 Output type</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OT9</name>
              <description>GPIOB9 Output type</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OT10</name>
              <description>GPIOB10 Output type</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OT11</name>
              <description>GPIOB11 Output type</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OT12</name>
              <description>GPIOB12 Output type</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OT13</name>
              <description>GPIOB13 Output type</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OT14</name>
              <description>GPIOB14 Output type</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>OT15</name>
              <description>GPIOB15 Output type</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPDDER</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>GPIOB0 output speed</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>GPIOB1 output speed</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>GPIOB2 output speed</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>GPIOB3 output speed</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>GPIOB4 output speed</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>GPIOB5 output speed</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>GPIOB6 output speed</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>GPIOB7 output speed</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>GPIOB8 output speed</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>GPIOB9 output speed</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>GPIOB10 output speed</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>GPIOB11 output speed</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>GPIOB12 output speed</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>GPIOB13 output speed</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>GPIOB14 output speed</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>GPIOB15 output speed</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>GPIOB0 pull up/pull down</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PUPD1</name>
              <description>GPIOB1 pull up/pull down</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PUPD2</name>
              <description>GPIOB2 pull up/pull down</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PUPD3</name>
              <description>GPIOB3 pull up/pull down</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PUPD4</name>
              <description>GPIOB4 pull up/pull down</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PUPD5</name>
              <description>GPIOB5 pull up/pull down</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PUPD6</name>
              <description>GPIOB6 pull up/pull down</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PUPD7</name>
              <description>GPIOB7 pull up/pull down</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PUPD8</name>
              <description>GPIOB8 pull up/pull down</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PUPD9</name>
              <description>GPIOB9 pull up/pull down</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PUPD10</name>
              <description>GPIOB10 pull up/pull down</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PUPD11</name>
              <description>GPIOB11 pull up/pull down</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>PUPD12</name>
              <description>GPIOB12 pull up/pull down</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PUPD13</name>
              <description>GPIOB13 pull up/pull down</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PUPD14</name>
              <description>GPIOB14 pull up/pull down</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>PUPD15</name>
              <description>GPIOB15 pull up/pull down</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ID0</name>
              <description>GPIOB0 input data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>GPIOB1 input data</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>GPIOB2 input data</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>GPIOB3 input data</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>GPIOB4 input data</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>GPIOB5 input data</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID6</name>
              <description>GPIOB6 input data</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID7</name>
              <description>GPIOB7 input data</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID8</name>
              <description>GPIOB8 input data</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID9</name>
              <description>GPIOB9 input data</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID10</name>
              <description>GPIOB10 input data</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID11</name>
              <description>GPIOB11 input data</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID12</name>
              <description>GPIOB12 input data</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID13</name>
              <description>GPIOB13 input data</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID14</name>
              <description>GPIOB14 input data</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID15</name>
              <description>GPIOB15 input data</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>OD0</name>
              <description>GPIOB0 output data</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OD1</name>
              <description>GPIOB1 output data</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OD2</name>
              <description>GPIOB2 output data</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OD3</name>
              <description>GPIOB3 output data</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OD4</name>
              <description>GPIOB4 output data</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OD5</name>
              <description>GPIOB5 output data</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OD6</name>
              <description>GPIOB6 output data</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OD7</name>
              <description>GPIOB7 output data</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OD8</name>
              <description>GPIOB8 output data</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OD9</name>
              <description>GPIOB9 output data</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OD10</name>
              <description>GPIOB10 output data</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OD11</name>
              <description>GPIOB11 output data</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OD12</name>
              <description>GPIOB12 output data</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OD13</name>
              <description>GPIOB13 output data</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OD14</name>
              <description>GPIOB14 output data</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>OD15</name>
              <description>GPIOB15 output data</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
