Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>BSRR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>BS0</name>
              <description>GPIOE0 output set</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BS1</name>
              <description>GPIOE1 output set</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BS2</name>
              <description>GPIOE2 output set</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BS3</name>
              <description>GPIOE3 output set</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BS4</name>
              <description>GPIOE4 output set</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BS5</name>
              <description>GPIOE5 output set</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BS6</name>
              <description>GPIOE6 output set</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BS7</name>
              <description>GPIOE7 output set</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BS8</name>
              <description>GPIOE8 output set</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BS9</name>
              <description>GPIOE9 output set</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BS10</name>
              <description>GPIOE10 output set</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BS11</name>
              <description>GPIOE11 output set</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BS12</name>
              <description>GPIOE12 output set</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BS13</name>
              <description>GPIOE13 output set</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BS14</name>
              <description>GPIOE14 output set</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BS15</name>
              <description>GPIOE15 output set</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BR0</name>
              <description>GPIOE0 outut reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOE1 outut reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOE2 outut reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOE3 outut reset</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOE4 outut reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOE5 outut reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOE6 outut reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOE7 outut reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOE8 outut reset</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOE9 outut reset</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOE10 outut reset</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOE11 outut reset</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BR12</name>
              <description>GPIOE12 outut reset</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>BR13</name>
              <description>GPIOE13 outut reset</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>BR14</name>
              <description>GPIOE14 outut reset</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>BR15</name>
              <description>GPIOE15 outut reset</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>GPIOE lock(bit0)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>GPIOE lock(bit1)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>GPIOE lock(bit2)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>GPIOE lock(bit3)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>GPIOE lock(bit4)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>GPIOE lock(bit5)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCK6</name>
              <description>GPIOE lock(bit6)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCK7</name>
              <description>GPIOE lock(bit7)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCK8</name>
              <description>GPIOE lock(bit8)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCK9</name>
              <description>GPIOE lock(bit9)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LCK10</name>
              <description>GPIOE lock(bit10)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LCK11</name>
              <description>GPIOE lock(bit11)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LCK12</name>
              <description>GPIOE lock(bit12)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LCK13</name>
              <description>GPIOE lock(bit13)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LCK14</name>
              <description>GPIOE lock(bit14)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LCK15</name>
              <description>GPIOE lock(bit15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>GPIOE lock key</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>GPIOE0 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>GPIOE1 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>GPIOE2 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>GPIOE3 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>GPIOE4 AF select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>GPIOE5 AF select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>GPIOE6 AF select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>GPIOE7 AF select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>GPIOE8 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>GPIOE9 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>GPIOE10 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>GPIOE11 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>GPIOE12 AF select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>GPIOE13 AF select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>GPIOE14 AF select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>GPIOE15 AF select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>GPIOE 0 output pin reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOE 1 output pin reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOE 2 output pin reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOE 3 output pin reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOE 4 output pin reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOE 5 output pin reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOE 6 output pin reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOE 7 output pin reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOE 8 output pin reset</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOE 9 output pin reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOE 10 output pin reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOE 11 output pin reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BR12</name>
              <description>GPIOE 12 output pin reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BR13</name>
              <description>GPIOE 13 output pin reset</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BR14</name>
              <description>GPIOE 14 output pin reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BR15</name>
              <description>GPIOE 15 output pin reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
