Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOF</name>
      <baseAddress>0x48001400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODER0</name>
              <description>GPIOF0 MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MODER1</name>
              <description>GPIOF1 MODE</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MODER2</name>
              <description>GPIOF2 MODE</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MODER3</name>
              <description>GPIOF3 MODE</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODER4</name>
              <description>GPIOF4 MODE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MODER5</name>
              <description>GPIOF5 MODE</description>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OT0</name>
              <description>GPIOF0 Output type</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OT1</name>
              <description>GPIOF1 Output type</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OT2</name>
              <description>GPIOF2 Output type</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OT3</name>
              <description>GPIOF3 Output type</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OT4</name>
              <description>GPIOF4 Output type</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OT5</name>
              <description>GPIOF5 Output type</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPDDER</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>GPIOF0 output speed</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>GPIOF1 output speed</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>GPIOF2 output speed</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>GPIOF3 output speed</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>GPIOF4 output speed</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>GPIOF5 output speed</description>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>GPIOF0 pull up/pull down</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PUPD1</name>
              <description>GPIOF1 pull up/pull down</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PUPD2</name>
              <description>GPIOF2 pull up/pull down</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PUPD3</name>
              <description>GPIOF3 pull up/pull down</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PUPD4</name>
              <description>GPIOF4 pull up/pull down</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PUPD5</name>
              <description>GPIOF5 pull up/pull down</description>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ID0</name>
              <description>GPIOF0 input data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>GPIOF1 input data</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>GPIOF2 input data</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>GPIOF3 input data</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>GPIOF4 input data</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>GPIOF5 input data</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>OD0</name>
              <description>GPIOF0 output data</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OD1</name>
              <description>GPIOF1 output data</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OD2</name>
              <description>GPIOF2 output data</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OD3</name>
              <description>GPIOF3 output data</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OD4</name>
              <description>GPIOF4 output data</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OD5</name>
              <description>GPIOF5 output data</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>BS0</name>
              <description>GPIOF0 output set</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BS1</name>
              <description>GPIOF1 output set</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BS2</name>
              <description>GPIOF2 output set</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BS3</name>
              <description>GPIOF3 output set</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BS4</name>
              <description>GPIOF4 output set</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BS5</name>
              <description>GPIOF5 output set</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR0</name>
              <description>GPIOF0 outut reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOF1 outut reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOF2 outut reset</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOF3 outut reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOF4 outut reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOF5 outut reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>GPIOF lock(bit0)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>GPIOF lock(bit1)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>GPIOF lock(bit2)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>GPIOF lock(bit3)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>GPIOF lock(bit4)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>GPIOF lock(bit5)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>GPIOF lock key</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>GPIOF0 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>GPIOF1 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>GPIOF2 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>GPIOF3 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>GPIOF4 AF select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>GPIOF5 AF select</description>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>GPIOF 0 output pin reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOF 1 output pin reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOF 2 output pin reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOF 3 output pin reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOF 4 output pin reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOF 5 output pin reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
