Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <description>desc I2C</description>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 Event Interrupt</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 Error Interrupt</description>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <description>desc I2C</description>
      <baseAddress>0x40007800</baseAddress>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 Event Interrupt</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 Error Interrupt</description>
        <value>64</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <description>desc I2C</description>
      <baseAddress>0x40008400</baseAddress>
      <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 Event Interrupt</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 Error Interrupt</description>
        <value>66</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>IWDG KEY</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>IWDG preload</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RL</name>
              <description>IWDG reload</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCDC</name>
      <baseAddress>0x40017400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN0</name>
              <description>LCD0 enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EN1</name>
              <description>LCD1 enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EN2</name>
              <description>LCD2 enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EN3</name>
              <description>LCD3 enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MODE0</name>
              <description>LCD0 mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MODE1</name>
              <description>LCD1 mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MODE2</name>
              <description>LCD2 mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MODE3</name>
              <description>LCD3 mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD0_DR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>LCD0 data register</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD0_CMDR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CMD</name>
              <description>LCD0 command register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD0_WCFGR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD0 write ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD0 write DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD0 write DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD0_RCFGR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD0 read ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD0 read DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD0 read DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD1_DR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>LCD1 data register</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD1_CMDR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CMD</name>
              <description>LCD1 command register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD1_WCFGR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD1 write ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD1 write DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD1 write DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD1_RCFGR</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD1 read ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD1 read DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD1 read DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD2_DR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>LCD2 data register</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD2_CMDR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>CMD</name>
              <description>LCD2 command register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD2_WCFGR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD2 write ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD2 write DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD2 write DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD2_RCFGR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD2 read ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD2 read DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD2 read DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD3_DR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>LCD3 data register</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD3_CMDR</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CMD</name>
              <description>LCD3 command register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD3_WCFGR</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD3 write ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD3 write DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD3 write DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD3_RCFGR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>LCD3 read ADDSET</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAST</name>
              <description>LCD3 read DATAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>LCD3 read DATAHLD</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
