Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP</name>
      <baseAddress>0x40017000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>OPA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>Non reverse input selection</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>VM_SEL</name>
              <description>Reverse input selection</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPAHSM</name>
              <description>OPA high-speed mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OPAINTOEN</name>
              <description>OPA internal output enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OPA_VBIAS</name>
              <description>OPA Bias voltage selection</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>PGA_GAIN</name>
              <description>OPA configurable amplifier gain value</description>
              <bitRange>[18:14]</bitRange>
            </field>
            <field>
              <name>OPA1_VBSEL</name>
              <description>OPA1 Bias selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP1_CSR register Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>OPA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>Non reverse input selection</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>VM_SEL</name>
              <description>Reverse input selection</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPAHSM</name>
              <description>OPA high-speed mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OPAINTOEN</name>
              <description>OPA internal output enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PGA_GAIN</name>
              <description>OPA configurable amplifier gain value</description>
              <bitRange>[18:14]</bitRange>
            </field>
            <field>
              <name>OPA2_VBSEL</name>
              <description>OPA2 Bias selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP2_CSR register Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>OPA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>Non reverse input selection</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>VM_SEL</name>
              <description>Reverse input selection</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPAHSM</name>
              <description>OPA high-speed mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OPAINTOEN</name>
              <description>OPA internal output enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PGA_GAIN</name>
              <description>OPA configurable amplifier gain value</description>
              <bitRange>[18:14]</bitRange>
            </field>
            <field>
              <name>OPA3_VBSEL</name>
              <description>OPA3 Bias selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP3_CSR register Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCMR1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>VMS_SEL</name>
              <description>OPAMPx reverse phase input secondary selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VPS_SEL</name>
              <description>OPAMPx non inverting input secondary selection</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>T1CM_EN</name>
              <description>TIM1 Control Multiplexing Mode Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8CM_EN</name>
              <description>TIM8 Control Multiplexing Mode Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP1_TCMR register Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCMR2</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>VMS_SEL</name>
              <description>OPAMPx reverse phase input secondary selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VPS_SEL</name>
              <description>OPAMPx non inverting input secondary selection</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>T1CM_EN</name>
              <description>TIM1 Control Multiplexing Mode Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8CM_EN</name>
              <description>TIM8 Control Multiplexing Mode Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP2_TCMR register Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCMR3</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>VMS_SEL</name>
              <description>OPAMPx reverse phase input secondary selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VPS_SEL</name>
              <description>OPAMPx non inverting input secondary selection</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>T1CM_EN</name>
              <description>TIM1 Control Multiplexing Mode Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8CM_EN</name>
              <description>TIM8 Control Multiplexing Mode Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP3_TCMR register Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
