Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD through EXTI Line detection Interrupt</description>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LPMS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VOS</name>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>BKPVR_VOS</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>LPR</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FLS_WUPT</name>
              <bitRange>[18:17]</bitRange>
            </field>
            <field>
              <name>STDBY_MRRDY_WAIT</name>
              <bitRange>[20:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PVDE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLS</name>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_CTRL</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EWUP1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EWUP2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EWUP3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EWUP4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EWUP5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RRS</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>WP1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WP2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WP3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WP4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WP5</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>WUF1</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF2</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF3</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF4</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF5</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CWUF1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CWUF2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CWUF3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CWUF4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CWUF5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSBF</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>HSION</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSITRIM</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>HSICAL_L</name>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEON</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSSON</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>HSICAL_H</name>
              <bitRange>[23:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLON</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>HPRE</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PPRE1</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PPRE2</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>ADCPRE</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>USBPRE</name>
              <bitRange>[22:20]</bitRange>
            </field>
            <field>
              <name>MCO</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSI48RDYF</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSIRDYIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>HSI48RDYIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LSIRDYC</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSERDYC</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HSIRDYC</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HSERDYC</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLRDYC</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>HSI48RDYC</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CSSC</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1RSTR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMA1RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMA2RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CORDICRST</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ESMCRST</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2RSTR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>IOPARST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IOPBRST</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IOPCRST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IOPDRST</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IOPERST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IOPFRST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SDIORST</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AESRST</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB1RST</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB2RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ETHRST</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1RSTR1</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>TIM2RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM4RST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM5RST</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIM6RST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7RST</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIM12RST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIM13RST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIM14RST</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIM18RST</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WWDGRST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI3RST</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>USART2RST</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>USART3RST</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>UART1RST</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>UART2RST</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2RST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>UART3RST</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN1RST</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CAN2RST</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACRST</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C3RST</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CTCRST</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1RSTR2</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>LPTIM1RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LPUART1RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C4RST</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2RSTR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC1RST</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC2RST</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TIM8RST</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC3RST</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM9RST</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TIM10RST</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TIM11RST</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TIM15RST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TIM19RST</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>RNGRST</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>COMPRST</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPAMPRST</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LCDCRST</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1ENR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>DMA1EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMA2EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SRAMEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FMCEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CORDICEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ESMCEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2ENR</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>IOPAEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IOPBEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IOPCEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IOPDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IOPEEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IOPFEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SDIOEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AESEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB1EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB2EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ETHEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
