Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>APB1ENR1</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>TIM2EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM4EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM5EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIM6EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIM12EN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIM13EN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIM14EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIM18EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI3EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>USART2EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>USART3EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>UART1EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>UART2EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>UART3EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN1EN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CAN2EN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BKPEN</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C3EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CTCEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1ENR2</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LPTIM1EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LPUART1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C4EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2ENR</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC1EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC2EN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TIM8EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC3EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM9EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TIM10EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TIM11EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TIM15EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TIM19EN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>RNGEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>COMPEN</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPAMPEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LCDCEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>USART1SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>USART2SEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>USART3SEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>LPUART1SEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP3SEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>COMP4SEL</name>
              <bitRange>[23:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>LSEON</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSEDRV</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>RTCSEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>LSION</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RMVF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRRSTF</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>MCOPRE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>HSI48ON</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HSI48RDY</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSI48TRIM</name>
              <bitRange>[15:9]</bitRange>
            </field>
            <field>
              <name>HSI48CAL</name>
              <bitRange>[28:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDSEL</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>USBSELHSI48</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>CANCKSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>HSEDRV</name>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLLXTPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PLLPREDIV</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PLLPOSTDIV</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PLLFBDIV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PLLCPGAIN</name>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
