Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <baseAddress>0x40016800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RNG</name>
        <description>RNG global Interrupt</description>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RBG0_EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBG1_EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALGR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RNG_ALG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DATA_RDY</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>RNG_DATA</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>RSS0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSS1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TAMPER</name>
        <description>Intrusion detection global interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>RTC global interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>CRH</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SECIE</name>
              <description>Second interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRIE</name>
              <description>Alarm interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWIE</name>
              <description>Overflow interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRL</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SECF</name>
              <description>Second flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRF</name>
              <description>Alarm flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWF</name>
              <description>Overflow flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronized flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNF</name>
              <description>Configuration flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RTOFF</name>
              <description>RTC operation OFF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRL0</name>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC pre-scaler reload value byte0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRL1</name>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC pre-scaler reload value byte1</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRL2</name>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC pre-scaler reload value byte2</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV0</name>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_DIV</name>
              <description>RTC clock divider byte0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV1</name>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_DIV</name>
              <description>RTC clock divider byte1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV2</name>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_DIV</name>
              <description>RTC clock divider byte2</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT0</name>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>RTC counter byte0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT1</name>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>RTC counter byte1</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT2</name>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>RTC counter byte2</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT3</name>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>RTC counter byte3</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALR0</name>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_ALR</name>
              <description>RTC alarm byte0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALR1</name>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_ALR</name>
              <description>RTC alarm byte1</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALR2</name>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_ALR</name>
              <description>RTC alarm byte2</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALR3</name>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RTC_ALR</name>
              <description>RTC alarm byte3</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
