Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDIO</name>
      <description>desc SDIO</description>
      <baseAddress>0x48002000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDIO</name>
        <description>SDIO global Interrupt</description>
        <value>49</value>
      </interrupt>
      <registers>
        <register>
          <name>POWER</name>
          <description>desc POWER</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PWRCTRL</name>
              <description>desc PWRCTRL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCR</name>
          <description>desc CLKCR</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>desc CLKDIV</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CLKEN</name>
              <description>desc CLKEN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWRSAV</name>
              <description>desc PWRSAV</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WIDBUS</name>
              <description>desc WIDBUS</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>SMPCLKSEL</name>
              <description>desc SMPCLKSEL</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SMPEN</name>
              <description>desc SMPEN</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CKSEL</name>
              <description>desc CKSEL</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARG</name>
          <description>desc ARG</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CMDARG</name>
              <description>desc CMDARG</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>desc CMD</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>CMDINDEX</name>
              <description>desc CMDINDEX</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>WAITRESP</name>
              <description>desc WAITRESP</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RESPLEN</name>
              <description>desc RESPLEN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHECKRESPCRC</name>
              <description>desc CHECKRESPCRC</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DEXPECT</name>
              <description>desc DEXPECT</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DTMODE</name>
              <description>desc DTMODE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUTOSTOP</name>
              <description>desc AUTOSTOP</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WAITPEND</name>
              <description>desc WAITPEND</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ABORTCMD</name>
              <description>desc ABORTCMD</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUTOINIT</name>
              <description>desc AUTOINIT</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>REGSYNC</name>
              <description>desc REGSYNC</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ATACMD</name>
              <description>desc ATACMD</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IEN</name>
              <description>desc IEN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>BOOTEN</name>
              <description>desc BOOTEN</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BOOTACK</name>
              <description>desc BOOTACK</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BOOTDIS</name>
              <description>desc BOOTDIS</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BOOTMODE</name>
              <description>desc BOOTMODE</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>STARTCMD</name>
              <description>desc STARTCMD</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESPCMD</name>
          <description>desc RESPCMD</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>RESPCMD</name>
              <description>desc RESPCMD</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP0</name>
          <description>desc RESP0</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CARDSTATUS1</name>
              <description>desc CARDSTATUS1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP1</name>
          <description>desc RESP1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CARDSTATUS2</name>
              <description>desc CARDSTATUS2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP2</name>
          <description>desc RESP2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CARDSTATUS3</name>
              <description>desc CARDSTATUS3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP3</name>
          <description>desc RESP3</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>CARDSTATUS4</name>
              <description>desc CARDSTATUS4</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMOUT</name>
          <description>desc TMOUT</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>RESPTIME</name>
              <description>desc RESPTIME</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DATATIME</name>
              <description>desc DATATIME</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BLKSIZ</name>
          <description>desc BLKSIZ</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DBLOCKSIZE</name>
              <description>desc DBLOCKSIZE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DLEN</name>
          <description>desc DLEN</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DATALENGTH</name>
              <description>desc DATALENGTH</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>desc CTRL</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SDIORST</name>
              <description>desc SDIORST</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FIFORST</name>
              <description>desc FIFORST</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INTEN</name>
              <description>desc INTEN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>desc DMAEN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>READWAIT</name>
              <description>desc READWAIT</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOIRQRESP</name>
              <description>desc AUTOIRQRESP</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ABORTRD</name>
              <description>desc ABORTRD</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CCSDEN</name>
              <description>desc CCSDEN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUTOSTOPCCSD</name>
              <description>desc AUTOSTOPCCSD</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CEATAINTEN</name>
              <description>desc CEATAINTEN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODPUEN</name>
              <description>desc ODPUEN</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>desc STATUS</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>RXWMARK</name>
              <description>desc RXWMARK</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXWMARK</name>
              <description>desc TXWMARK</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOE</name>
              <description>desc FIFOE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOF</name>
              <description>desc FIFOF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDFSM</name>
              <description>desc CMDFSM</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CARDPRESENT</name>
              <description>desc CARDPRESENT</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CARDBSY</name>
              <description>desc CARDBSY</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOCNT</name>
              <description>desc FIFOCNT</description>
              <bitRange>[29:17]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTS</name>
          <description>desc INTSTS</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CAD</name>
              <description>desc CAD</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE</name>
              <description>desc RE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CD</name>
              <description>desc CD</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DTO</name>
              <description>desc DTO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXDR</name>
              <description>desc TXDR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXDR</name>
              <description>desc RXDR</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RCRC</name>
              <description>desc RCRC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DCRC</name>
              <description>desc DCRC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTO_BAR</name>
              <description>desc RTO_BAR</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DRTO_BDS</name>
              <description>desc DRTO_BDS</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HTO</name>
              <description>desc HTO</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FRUN</name>
              <description>desc FRUN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>HLE</name>
              <description>desc HLE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SBE</name>
              <description>desc SBE</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ACD</name>
              <description>desc ACD</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EBE</name>
              <description>desc EBE</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SDIOINT</name>
              <description>desc SDIOINT</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMASK</name>
          <description>desc INTMASK</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CADIE</name>
              <description>desc CADIE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REIE</name>
              <description>desc REIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CDIE</name>
              <description>desc CDIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DTOIE</name>
              <description>desc DTOIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXDRIE</name>
              <description>desc TXDRIE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXDRIE</name>
              <description>desc RXDRIE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RCRCIE</name>
              <description>desc RCRCIE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DCRCIE</name>
              <description>desc DCRCIE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTOIE</name>
              <description>desc RTOIE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DRTOIE</name>
              <description>desc DRTOIE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HTOIE</name>
              <description>desc HTOIE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FRUNIE</name>
              <description>desc FRUNIE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>HLEIE</name>
              <description>desc HLEIE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SBEIE</name>
              <description>desc SBEIE</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ACDIE</name>
              <description>desc ACDIE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EBEIE</name>
              <description>desc EBEIE</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SDIOINTIE</name>
              <description>desc SDIOINTIE</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTH</name>
          <description>desc FIFOTH</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>TXWMARK</name>
              <description>desc TXWMARK</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>RXWMARK</name>
              <description>desc RXWMARK</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCBCNT</name>
          <description>desc TCBCNT</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>TCBCNT</name>
              <description>desc TCBCNT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBBCNT</name>
          <description>desc TBBCNT</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>TBBCNT</name>
              <description>desc TBBCNT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
