Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <description>desc SPI</description>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
      <description>desc SPI</description>
      <baseAddress>0x40003C00</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global Interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>memory mapping mode</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ETH_PHYSEL</name>
              <description>Ethernet PHY Interface selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM2ITR1_REMAP</name>
              <description>timer2 inner trigger input 1 mapping</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>PTP_PPS_REMAP</name>
              <description>ETH PTP PPS mapping</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CTC_SOF_SEL</name>
              <description>selection of usb sof to ctc</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C1_FMP</name>
              <description>I2C1 Fast-mode Plus driving capability activation</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <description>I2C2 Fast-mode Plus driving capability activation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C3_FMP</name>
              <description>I2C3 Fast-mode Plus driving capability activation</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C4_FMP</name>
              <description>I2C4 Fast-mode Plus driving capability activation</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C_EIIC</name>
              <description>I2C analog filter enable</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CLL</name>
              <description>core lockup enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPL</name>
              <description>sram parity lock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PVDL</name>
              <description>pvd lock enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ECCL</name>
              <description>ecc lock</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPF</name>
              <description>SRAM parity flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP1</name>
              <description>DMA1 ch1 mapping</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP2</name>
              <description>DMA1 ch2 mapping</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP3</name>
              <description>DMA1 ch3 mapping</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP4</name>
              <description>DMA1 ch4 mapping</description>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP5</name>
              <description>DMA1 ch5 mapping</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP6</name>
              <description>DMA1 ch6 mapping</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP1</name>
              <description>DMA2 ch1 mapping</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP2</name>
              <description>DMA2 ch2 mapping</description>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR5</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DMA2_MAP3</name>
              <description>DMA2 ch3 mapping</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP4</name>
              <description>DMA2 ch4 mapping</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP5</name>
              <description>DMA2 ch5 mapping</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP6</name>
              <description>DMA2 ch6 mapping</description>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>EXTI2</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>EXTI12</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ENS</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>GPIOA noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ENS</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>GPIOB noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ENS</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PC_ENS</name>
              <description>GPIOC noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ENS</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PD_ENS</name>
              <description>GPIOD noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_ENS</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>PE_ENS</name>
              <description>GPIOE noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_ENS</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PF_ENS</name>
              <description>GPIOF noise filter enable</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ANA2ENR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>PA0_ENA2</name>
              <description>GPIOA0 ANA2 enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PA1_ENA2</name>
              <description>GPIOA1 ANA2 enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PA2_ENA2</name>
              <description>GPIOA2 ANA2 enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PA3_ENA2</name>
              <description>GPIOA3 ANA2 enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PA4_ENA2</name>
              <description>GPIOA4 ANA2 enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PA5_ENA2</name>
              <description>GPIOA5 ANA2 enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PA7_ENA2</name>
              <description>GPIOA7 ANA2 enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PA10_ENA2</name>
              <description>GPIOA10 ANA2 enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ANA2ENR</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>PB0_ENA2</name>
              <description>GPIOB0 ANA2 enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1_ENA2</name>
              <description>GPIOB1 ANA2 enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2_ENA2</name>
              <description>GPIOB2 ANA2 enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ANA2ENR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>PC0_ENA2</name>
              <description>GPIOC0 ANA2 enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PC1_ENA2</name>
              <description>GPIOC1 ANA2 enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PC2_ENA2</name>
              <description>GPIOC2 ANA2 enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PC3_ENA2</name>
              <description>GPIOC3 ANA2 enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PC14_ENA2</name>
              <description>GPIOC14 ANA2 enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PC15_ENA2</name>
              <description>GPIOC15 ANA2 enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ANA2ENR</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>PD10_ENA2</name>
              <description>GPIOD10_ANA2 enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PD11_ENA2</name>
              <description>GPIOD11_ANA2 enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PD12_ENA2</name>
              <description>GPIOD12_ANA2 enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PD13_ENA2</name>
              <description>GPIOD13_ANA2 enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_ANA2ENR</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>PE7_ENA2</name>
              <description>GPIOE7_ANA2 enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PE8_ENA2</name>
              <description>GPIOE8_ANA2 enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PE10_ENA2</name>
              <description>GPIOE10_ANA2 enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PE11_ENA2</name>
              <description>GPIOE11_ANA2 enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PE12_ENA2</name>
              <description>GPIOE12_ANA2 enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_ANA2ENR</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>PF0_ENA2</name>
              <description>GPIOF0_ANA2 enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PF1_ENA2</name>
              <description>GPIOF1_ANA2 enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>CCMER</name>
              <description>CCM SRAM erase</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CCM_BSY</name>
              <description>CCM SRAM busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
