Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>SWPR</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>P0WP</name>
              <description>CCM SRAM page 0 write protection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>P1WP</name>
              <description>CCM SRAM page 1 write protection</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>P2WP</name>
              <description>CCM SRAM page 2 write protection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>P3WP</name>
              <description>CCM SRAM page 3 write protection</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P4WP</name>
              <description>CCM SRAM page 4 write protection</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>P5WP</name>
              <description>CCM SRAM page 5 write protection</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>P6WP</name>
              <description>CCM SRAM page 6 write protection</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>P7WP</name>
              <description>CCM SRAM page 7 write protection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>P8WP</name>
              <description>CCM SRAM page 8 write protection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>P9WP</name>
              <description>CCM SRAM page 9 write protection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>P10WP</name>
              <description>CCM SRAM page 10 write protection</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>P11WP</name>
              <description>CCM SRAM page 11 write protection</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>P12WP</name>
              <description>CCM SRAM page 12 write protection</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>P13WP</name>
              <description>CCM SRAM page 13 write protection</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>P14WP</name>
              <description>CCM SRAM page 14 write protection</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>P15WP</name>
              <description>CCM SRAM page 15 write protection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>P16WP</name>
              <description>CCM SRAM page 16 write protection</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>P17WP</name>
              <description>CCM SRAM page 17 write protection</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>P18WP</name>
              <description>CCM SRAM page 18 write protection</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>P19WP</name>
              <description>CCM SRAM page 19 write protection</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>P20WP</name>
              <description>CCM SRAM page 20 write protection</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>P21WP</name>
              <description>CCM SRAM page 21 write protection</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>P22WP</name>
              <description>CCM SRAM page 22 write protection</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>P23WP</name>
              <description>CCM SRAM page 23 write protection</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>P24WP</name>
              <description>CCM SRAM page 24 write protection</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>P25WP</name>
              <description>CCM SRAM page 25 write protection</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>P26WP</name>
              <description>CCM SRAM page 26 write protection</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>P27WP</name>
              <description>CCM SRAM page 27 write protection</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>P28WP</name>
              <description>CCM SRAM page 28 write protection</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>P29WP</name>
              <description>CCM SRAM page 29 write protection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>P30WP</name>
              <description>CCM SRAM page 30 write protection</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>P31WP</name>
              <description>CCM SRAM page 31 write protection</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SKR</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>protective key of SYSCFG_SCSR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
