Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>BDTR</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DTG</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BKF</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>BK2F</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>BK2E</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BK2P</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BKDSRM</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BK2DSRM</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BKBID</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>BK2BID</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>CCR5</name>
              <bitRange>[19:0]</bitRange>
            </field>
            <field>
              <name>GC5C1</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>GC5C2</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>GC5C3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>CCR5</name>
              <bitRange>[19:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR3</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>OC5FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC5PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC5M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC5CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OC6FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC6PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC6M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC6CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC5M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC6M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR2</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>DTGF</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DTAE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DTPE</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IDIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FIDX</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IPOS</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PW</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PWPRSC</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>TI1SEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>TI2SEL</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>TI3SEL</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TI4SEL</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>BKINE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKCMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BKCMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKCMP3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BKCMP4E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BKCMP5E</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BKCMP6E</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BKCMP7E</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BKCMP8E</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BKINP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BKCMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BKCMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKCMP3P</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKCMP4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ETRSEL</name>
              <bitRange>[17:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>BK2INE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BK2CMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BK2CMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BK2CMP3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BK2CMP4E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BK2CMP5E</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BK2CMP6E</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BK2CMP7E</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BK2CMP8E</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BK2INP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BK2CMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BK2CMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BK2CMP3P</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BK2CMP4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OCRSEL</name>
              <bitRange>[18:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMXDCR</name>
          <addressOffset>0x3DC</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DBA</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <addressOffset>0x3E0</addressOffset>
          <fields>
            <field>
              <name>DMAB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
