Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART2</name>
      <baseAddress>0x40005000</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2 global Interrupt</description>
        <value>77</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART3</name>
      <baseAddress>0x40005C00</baseAddress>
      <interrupt>
        <name>UART3</name>
        <description>UART3 global Interrupt</description>
        <value>78</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USART1</name>
      <groupName>USART</groupName>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART1</name>
        <description>USART1 global Interrupt</description>
        <value>37</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>Framing error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NE</name>
              <description>Noise error flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <description>overrun error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>idle</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE_RXFNF</name>
              <description>Read data register not empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE_TXFNF</name>
              <description>Transmit data register empty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LBD</name>
              <description>LIN break detection flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTS</name>
              <description>cts flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ABRF</name>
              <description>auto baud rate flag</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRE</name>
              <description>auto baud rateerror</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRQ</name>
              <description>auto baud rate req</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFT</name>
              <description>txfifo threshold flag</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFT</name>
              <description>rxfifo threshoold flag</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFF</name>
              <description>rxfifo full</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <description>txfifo empty</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOBF</name>
              <description>end of block flag</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RTOF</name>
              <description>rto flag</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>TDR</name>
              <description>tdr</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DIV_F</name>
              <description>DIV_Fraction</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DIV_M</name>
              <description>DIV_Mantissa</description>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SBK</name>
              <description>Send break</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RWU</name>
              <description>Receiver wakeup</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLE interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RXNE interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>send complete int enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>txe</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PEIE</name>
              <description>PE interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PS</name>
              <description>Parity selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PCE</name>
              <description>Parity control enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <description>Wakeup method</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>word length</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UE</name>
              <description>uesart enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>M1</name>
              <description>word length</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MSB</name>
              <description>msb</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>MMRQ</name>
              <description>mm request</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADDM7</name>
              <description>addm7</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWAP</name>
              <description>swap</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TXFTCFG</name>
              <description>txfifo threshoold cfg</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>RXFTCFG</name>
              <description>rxfifo threshoold cfg</description>
              <bitRange>[24:22]</bitRange>
            </field>
            <field>
              <name>RX_INV</name>
              <description>rxinv</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TX_INV</name>
              <description>txinv</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DATAINV</name>
              <description>datainv</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>RXFRQ</name>
              <description>receive data flush request</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>TXFRQ</name>
              <description>Transmit data flush request</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FIFOEN</name>
              <description>fifo en</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>LBDL</name>
              <description>LIN break detection length</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LBDIE</name>
              <description>lin break enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LBCL</name>
              <description>lbcl</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPHA</name>
              <description>cpha</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>cpol</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CLKEN</name>
              <description>clk en</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>stop bit</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LINEN</name>
              <description>lin enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADD</name>
              <description>address</description>
              <bitRange>[22:15]</bitRange>
            </field>
            <field>
              <name>DEM</name>
              <description>dem</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DEP</name>
              <description>dep</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EIE</name>
              <description>error int enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <description>iren enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IRLP</name>
              <description>idra lowpower</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HDSEL</name>
              <description>hdsel</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NACK</name>
              <description>scen nack enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SCEN</name>
              <description>scen enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMAR</name>
              <description>dma rx enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMAT</name>
              <description>dma tx enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTSE</name>
              <description>rts enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTSE</name>
              <description>cts enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CTSIE</name>
              <description>cts int enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVER8</name>
              <description>oversampling</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ABREN</name>
              <description>autobaud enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ABRMOD</name>
              <description>auto baud mod</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>RXFFIE</name>
              <description>rxff int enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TXFEIE</name>
              <description>txfe int enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXFTIE</name>
              <description>rxft int enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXFTIE</name>
              <description>txft int enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DEDT</name>
              <description>dedt int enable</description>
              <bitRange>[23:19]</bitRange>
            </field>
            <field>
              <name>DEAT</name>
              <description>deat int enable</description>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>RTOIE</name>
              <description>rto int enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EOBIE</name>
              <description>eob int enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GTPR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler value</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>GT</name>
              <description>Guard time value</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTOR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>RTO</name>
              <description>receive timeout</description>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>BLEN</name>
              <description>blocken length</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RDR</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RDR</name>
              <description>rdr</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
