Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART2</name>
      <baseAddress>0x40004400</baseAddress>
      <interrupt>
        <name>USART2</name>
        <description>USART2 global Interrupt</description>
        <value>38</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART3</name>
      <baseAddress>0x40004800</baseAddress>
      <interrupt>
        <name>USART3</name>
        <description>USART3 global Interrupt</description>
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USB1_OTG_DEVICE</name>
      <description>USB on the go full speed</description>
      <baseAddress>0x48040800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FS_DCFG</name>
          <description>OTG_FS device configuration register (OTG_FS_DCFG)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DSPD</name>
              <description>Device speed</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>NZLSOHSK</name>
              <description>Non-zero-length status OUT handshake</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[10:4]</bitRange>
            </field>
            <field>
              <name>PFIVL</name>
              <description>Periodic frame interval</description>
              <bitRange>[12:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DCTL</name>
          <description>OTG_FS device control register (OTG_FS_DCTL)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RWUSIG</name>
              <description>Remote wakeup signaling</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SDIS</name>
              <description>Soft disconnect</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GINSTS</name>
              <description>Global IN NAK status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GONSTS</name>
              <description>Global OUT NAK status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCTL</name>
              <description>Test control</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>SGINAK</name>
              <description>Set global IN NAK</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CGINAK</name>
              <description>Clear global IN NAK</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SGONAK</name>
              <description>Set global OUT NAK</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CGONAK</name>
              <description>Clear global OUT NAK</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>POPRGDNE</name>
              <description>Power-on programming done</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DSTS</name>
          <description>OTG_FS device status register (OTG_FS_DSTS)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SUSPSTS</name>
              <description>Suspend status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENUMSPD</name>
              <description>Enumerated speed</description>
              <bitRange>[2:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EERR</name>
              <description>Erratic error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FNSOF</name>
              <description>Frame number of the received SOF</description>
              <bitRange>[21:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DIEPMSK</name>
          <description>OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed interrupt mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDM</name>
              <description>Endpoint disabled interrupt mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOM</name>
              <description>Timeout condition mask (Non-isochronous endpoints)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ITTXFEMSK</name>
              <description>IN token received when TxFIFO empty mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>INEPNMM</name>
              <description>IN token received with EP mismatch mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>INEPNEM</name>
              <description>IN endpoint NAK effective mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DOEPMSK</name>
          <description>OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed interrupt mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDM</name>
              <description>Endpoint disabled interrupt mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STUPM</name>
              <description>SETUP phase done mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OTEPDM</name>
              <description>OUT token received when endpoint disabled mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DAINT</name>
          <description>OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>IEPINT</name>
              <description>IN endpoint interrupt bits</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OEPINT</name>
              <description>OUT endpoint interrupt bits</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DAINTMSK</name>
          <description>OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK)</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>IEPM</name>
              <description>IN EP interrupt mask bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>OEPINT</name>
              <description>OUT endpoint interrupt bits</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSDIS</name>
          <description>OTG_FS device VBUS discharge time register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>VBUSDT</name>
              <description>Device VBUS discharge time</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSPULSE</name>
          <description>OTG_FS device VBUS pulsing time register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DVBUSP</name>
              <description>Device VBUS pulsing time</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEMPMSK</name>
          <description>OTG_FS device IN endpoint FIFO empty interrupt mask register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>INEPTXFEM</name>
              <description>IN EP Tx FIFO empty interrupt mask bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DIEPCTL0</name>
          <description>OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)</description>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USB active endpoint</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK status</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL handshake</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO number</description>
              <bitRange>[25:22]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint disable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT0</name>
          <description>device endpoint-x interrupt register</description>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ0</name>
          <description>device endpoint-0 transfer size register</description>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[20:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS0</name>
          <description>OTG_FS device IN endpoint transmit FIFO status register</description>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space available</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL1</name>
          <description>OTG device endpoint-1 control register</description>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>EONUM/DPID</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TXFNUM</description>
              <bitRange>[25:22]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID/SEVNFRM</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SODDFRM_SD1PID</name>
              <description>SODDFRM/SD1PID</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT1</name>
          <description>device endpoint-1 interrupt register</description>
          <addressOffset>0x128</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ1</name>
          <description>device endpoint-1 transfer size register</description>
          <addressOffset>0x130</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS1</name>
          <description>OTG_FS device IN endpoint transmit FIFO status register</description>
          <addressOffset>0x138</addressOffset>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space available</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL2</name>
          <description>OTG device endpoint-2 control register</description>
          <addressOffset>0x140</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>EONUM/DPID</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TXFNUM</description>
              <bitRange>[25:22]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID/SEVNFRM</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SODDFRM</name>
              <description>SODDFRM</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT2</name>
          <description>device endpoint-2 interrupt register</description>
          <addressOffset>0x148</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
