Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>DIEPTSIZ2</name>
          <description>device endpoint-2 transfer size register</description>
          <addressOffset>0x150</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS2</name>
          <description>OTG_FS device IN endpoint transmit FIFO status register</description>
          <addressOffset>0x158</addressOffset>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space available</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL3</name>
          <description>OTG device endpoint-3 control register</description>
          <addressOffset>0x160</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>EONUM/DPID</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TXFNUM</description>
              <bitRange>[25:22]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID/SEVNFRM</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SODDFRM</name>
              <description>SODDFRM</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT3</name>
          <description>device endpoint-3 interrupt register</description>
          <addressOffset>0x168</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ3</name>
          <description>device endpoint-3 transfer size register</description>
          <addressOffset>0x170</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS3</name>
          <description>OTG_FS device IN endpoint transmit FIFO status register</description>
          <addressOffset>0x178</addressOffset>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space available</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL0</name>
          <description>device endpoint-0 control register</description>
          <addressOffset>0x300</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SNPM</name>
              <description>SNPM</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT0</name>
          <description>device endpoint-0 interrupt register</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ0</name>
          <description>device OUT endpoint-0 transfer size register</description>
          <addressOffset>0x310</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>STUPCNT</name>
              <description>SETUP packet count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL1</name>
          <description>device endpoint-1 control register</description>
          <addressOffset>0x320</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>EONUM/DPID</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>SNPM</name>
              <description>SNPM</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID/SEVNFRM</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SODDFRM</name>
              <description>SODDFRM</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT1</name>
          <description>device endpoint-1 interrupt register</description>
          <addressOffset>0x328</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ1</name>
          <description>device OUT endpoint-1 transfer size register</description>
          <addressOffset>0x330</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>RXDPID_STUPCNT</name>
              <description>Received data PID/SETUP packet count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL2</name>
          <description>device endpoint-2 control register</description>
          <addressOffset>0x340</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>EONUM/DPID</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>SNPM</name>
              <description>SNPM</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID/SEVNFRM</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SODDFRM</name>
              <description>SODDFRM</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT2</name>
          <description>device endpoint-2 interrupt register</description>
          <addressOffset>0x348</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ2</name>
          <description>device OUT endpoint-2 transfer size register</description>
          <addressOffset>0x350</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>RXDPID_STUPCNT</name>
              <description>Received data PID/SETUP packet count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL3</name>
          <description>device endpoint-3 control register</description>
          <addressOffset>0x360</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>EONUM/DPID</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>SNPM</name>
              <description>SNPM</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID/SEVNFRM</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SODDFRM</name>
              <description>SODDFRM</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT3</name>
          <description>device endpoint-3 interrupt register</description>
          <addressOffset>0x368</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STUP</name>
              <description>STUP</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OTEPDIS</name>
              <description>OTEPDIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>B2BSTUP</name>
              <description>B2BSTUP</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ3</name>
          <description>device OUT endpoint-3 transfer size register</description>
          <addressOffset>0x370</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>RXDPID_STUPCNT</name>
              <description>Received data PID/SETUP packet count</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
