Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB1_OTG_GLOBAL</name>
      <description>USB on the go full speed</description>
      <baseAddress>0x48040000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>OTG1_FS</name>
        <description>USB1 OTG global interrupt</description>
        <value>21</value>
      </interrupt>
      <registers>
        <register>
          <name>FS_GOTGCTL</name>
          <description>OTG_FS control and status register (OTG_FS_GOTGCTL)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SRQSCS</name>
              <description>Session request success</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SRQ</name>
              <description>Session request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HNGSCS</name>
              <description>Host negotiation success</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HNPRQ</name>
              <description>HNP request</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HSHNPEN</name>
              <description>Host set HNP enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DHNPEN</name>
              <description>Device HNP enabled</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CIDSTS</name>
              <description>Connector ID status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBCT</name>
              <description>Long/short debounce time</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ASVLD</name>
              <description>A-session valid</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSVLD</name>
              <description>B-session valid</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GOTGINT</name>
          <description>OTG_FS interrupt register (OTG_FS_GOTGINT)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SEDET</name>
              <description>Session end detected</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SRSSCHG</name>
              <description>Session request success status change</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HNSSCHG</name>
              <description>Host negotiation success status change</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HNGDET</name>
              <description>Host negotiation detected</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADTOCHG</name>
              <description>A-device timeout change</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DBCDNE</name>
              <description>Debounce done</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GAHBCFG</name>
          <description>OTG_FS AHB configuration register (OTG_FS_GAHBCFG)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>GINT</name>
              <description>Global interrupt mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXFELVL</name>
              <description>TxFIFO empty level</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PTXFELVL</name>
              <description>Periodic TxFIFO empty level</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GUSBCFG</name>
          <description>OTG_FS USB configuration register (OTG_FS_GUSBCFG)</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>TOCAL</name>
              <description>FS timeout calibration</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PHYSEL</name>
              <description>Full Speed serial transceiver select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SRPCAP</name>
              <description>SRP-capable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HNPCAP</name>
              <description>HNP-capable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRDT</name>
              <description>USB turnaround time</description>
              <bitRange>[13:10]</bitRange>
            </field>
            <field>
              <name>FHMOD</name>
              <description>Force host mode</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FDMOD</name>
              <description>Force device mode</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CTXPKT</name>
              <description>Corrupt Tx packet</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GRSTCTL</name>
          <description>OTG_FS reset register (OTG_FS_GRSTCTL)</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CSRST</name>
              <description>Core soft reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HSRST</name>
              <description>HCLK soft reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FCRST</name>
              <description>Host frame counter reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXFFLSH</name>
              <description>RxFIFO flush</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXFFLSH</name>
              <description>TxFIFO flush</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO number</description>
              <bitRange>[10:6]</bitRange>
            </field>
            <field>
              <name>AHBIDL</name>
              <description>AHB master idle</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GINTSTS</name>
          <description>OTG_FS core interrupt register (OTG_FS_GINTSTS)</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CMOD</name>
              <description>Current mode of operation</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MMIS</name>
              <description>Mode mismatch interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OTGINT</name>
              <description>OTG interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF</name>
              <description>Start of frame</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXFLVL</name>
              <description>RxFIFO non-empty</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXFE</name>
              <description>Non-periodic TxFIFO empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GINAKEFF</name>
              <description>Global IN non-periodic NAK effective</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GOUTNAKEFF</name>
              <description>Global OUT NAK effective</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ESUSP</name>
              <description>Early suspend</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USBSUSP</name>
              <description>USB suspend</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <description>USB reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ENUMDNE</name>
              <description>Enumeration done</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ISOODRP</name>
              <description>Isochronous OUT packet dropped interrupt</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EOPF</name>
              <description>End of periodic frame interrupt</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IEPINT</name>
              <description>IN endpoint interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OEPINT</name>
              <description>OUT endpoint interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IISOIXFR</name>
              <description>Incomplete isochronous IN transfer</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IPXFR_INCOMPISOOUT</name>
              <description>Incomplete periodic transfer(Host mode)/Incomplete isochronous OUT transfer(Device mode)</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>HPRTINT</name>
              <description>Host port interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HCINT</name>
              <description>Host channels interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXFE</name>
              <description>Periodic TxFIFO empty</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CIDSCHG</name>
              <description>Connector ID status change</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DISCINT</name>
              <description>Disconnect detected interrupt</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SRQINT</name>
              <description>Session request/new session detected interrupt</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>WKUPINT</name>
              <description>Resume/remote wakeup detected interrupt</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GINTMSK</name>
          <description>OTG_FS interrupt mask register (OTG_FS_GINTMSK)</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>MMISM</name>
              <description>Mode mismatch interrupt mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OTGINT</name>
              <description>OTG interrupt mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOFM</name>
              <description>Start of frame mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXFLVLM</name>
              <description>Receive FIFO non-empty mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NPTXFEM</name>
              <description>Non-periodic TxFIFO empty mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>GINAKEFFM</name>
              <description>Global non-periodic IN NAK effective mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GONAKEFFM</name>
              <description>Global OUT NAK effective mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ESUSPM</name>
              <description>Early suspend mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USBSUSPM</name>
              <description>USB suspend mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <description>USB reset mask</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ENUMDNEM</name>
              <description>Enumeration done mask</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ISOODRPM</name>
              <description>Isochronous OUT packet dropped interrupt mask</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EOPFM</name>
              <description>End of periodic frame interrupt mask</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EPMISM</name>
              <description>Endpoint mismatch interrupt mask</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IEPINT</name>
              <description>IN endpoints interrupt mask</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>OEPINT</name>
              <description>OUT endpoints interrupt mask</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IISOIXFRM</name>
              <description>Incomplete isochronous IN transfer mask</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IPXFRM_IISOOXFRM</name>
              <description>Incomplete periodic transfer mask(Host mode)/Incomplete isochronous OUT transfer mask(Device mode)</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>PRTIM</name>
              <description>Host port interrupt mask</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HCIM</name>
              <description>Host channels interrupt mask</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>PTXFEM</name>
              <description>Periodic TxFIFO empty mask</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CIDSCHGM</name>
              <description>Connector ID status change mask</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DISCINT</name>
              <description>Disconnect detected interrupt mask</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SRQIM</name>
              <description>Session request/new session detected interrupt mask</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>WUIM</name>
              <description>Resume/remote wakeup detected interrupt mask</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GRXSTSR_DEVICE</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte count</description>
              <bitRange>[14:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[16:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet status</description>
              <bitRange>[20:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRMNUM</name>
              <description>Frame number</description>
              <bitRange>[24:21]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GRXSTSR_HOST</name>
          <alternateRegister>FS_GRXSTSR_DEVICE</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte count</description>
              <bitRange>[14:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[16:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet status</description>
              <bitRange>[20:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRMNUM</name>
              <description>Frame number</description>
              <bitRange>[24:21]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GRXFSIZ</name>
          <description>OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ)</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>RXFD</name>
              <description>RxFIFO depth</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GNPTXFSIZ_DEVICE</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>TX0FSA</name>
              <description>Endpoint 0 transmit RAM start address</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TX0FD</name>
              <description>Endpoint 0 TxFIFO depth</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GNPTXFSIZ_HOST</name>
          <alternateRegister>FS_GNPTXFSIZ_DEVICE</alternateRegister>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>NPTXFSA</name>
              <description>Non-periodic transmit RAM start address</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>NPTXFD</name>
              <description>Non-periodic TxFIFO depth</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_GNPTXSTS</name>
          <description>OTG_FS non-periodic transmit FIFO/queue status register (OTG_FS_GNPTXSTS)</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>NPTXFSAV</name>
              <description>Non-periodic TxFIFO space available</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTQXSAV</name>
              <description>Non-periodic transmit request queue space available</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQTOP</name>
              <description>Top of the non-periodic transmit request queue</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
