Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>FS_GCCFG</name>
          <description>OTG_FS general core configuration register (OTG_FS_GCCFG)</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PWRDWN</name>
              <description>Power down</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>VBUSASEN</name>
              <description>Enable the VBUS sensing device</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>VBUSBSEN</name>
              <description>Enable the VBUS sensing device</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SOFOUTEN</name>
              <description>SOF output enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_CID</name>
          <description>core ID register</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>PRODUCT_ID</name>
              <description>Product ID field</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HPTXFSIZ</name>
          <description>OTG_FS Host periodic transmit FIFO size register (OTG_FS_HPTXFSIZ)</description>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>PTXSA</name>
              <description>Host periodic TxFIFO start address</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>PTXFSIZ</name>
              <description>Host periodic TxFIFO depth</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DIEPTXF1</name>
          <description>OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF2)</description>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>INEPTXSA</name>
              <description>IN endpoint FIFO2 transmit RAM start address</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>INEPTXFD</name>
              <description>IN endpoint TxFIFO depth</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DIEPTXF2</name>
          <description>OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF3)</description>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>INEPTXSA</name>
              <description>IN endpoint FIFO3 transmit RAM start address</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>INEPTXFD</name>
              <description>IN endpoint TxFIFO depth</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_DIEPTXF3</name>
          <description>OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF4)</description>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>INEPTXSA</name>
              <description>IN endpoint FIFO4 transmit RAM start address</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>INEPTXFD</name>
              <description>IN endpoint TxFIFO depth</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB1_OTG_HOST</name>
      <description>USB on the go full speed</description>
      <baseAddress>0x48040400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FS_HCFG</name>
          <description>OTG_FS host configuration register (OTG_FS_HCFG)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>FSLSPCS</name>
              <description>FS/LS PHY clock select</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSLSS</name>
              <description>FS- and LS-only support</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFIR</name>
          <description>OTG_FS Host frame interval register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FRIVL</name>
              <description>Frame interval</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HFNUM</name>
          <description>OTG_FS host frame number/frame time remaining register (OTG_FS_HFNUM)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>FRNUM</name>
              <description>Frame number</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FTREM</name>
              <description>Frame time remaining</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HPTXSTS</name>
          <description>OTG_FS_Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS)</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PTXFSAVL</name>
              <description>Periodic transmit data FIFO space available</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>PTXQSAV</name>
              <description>Periodic transmit request queue space available</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQTOP</name>
              <description>Top of the periodic transmit request queue</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINT</name>
          <description>OTG_FS Host all channels interrupt register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>HAINT</name>
              <description>Channel interrupts</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINTMSK</name>
          <description>OTG_FS host all channels interrupt mask register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>HAINTM</name>
              <description>Channel interrupt mask</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HPRT</name>
          <description>OTG_FS host port control and status register (OTG_FS_HPRT)</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>PCSTS</name>
              <description>Port connect status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PCDET</name>
              <description>Port connect detected</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PENA</name>
              <description>Port enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PENCHNG</name>
              <description>Port enable/disable change</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>POCA</name>
              <description>Port overcurrent active</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>POCCHNG</name>
              <description>Port overcurrent change</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PRES</name>
              <description>Port resume</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PSUSP</name>
              <description>Port suspend</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PRST</name>
              <description>Port reset</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PLSTS</name>
              <description>Port line status</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PPWR</name>
              <description>Port power</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PTCTL</name>
              <description>Port test control</description>
              <bitRange>[16:13]</bitRange>
            </field>
            <field>
              <name>PSPD</name>
              <description>Port speed</description>
              <bitRange>[18:17]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCCHAR0</name>
          <description>OTG_FS host channel-0 characteristics register (OTG_FS_HCCHAR0)</description>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint direction</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-speed device</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multicount</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[28:22]</bitRange>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd frame</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel disable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINT0</name>
          <description>OTG_FS host channel-0 interrupt register (OTG_FS_HCINT0)</description>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHH</name>
              <description>Channel halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <description>Transaction error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERR</name>
              <description>Babble error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMOR</name>
              <description>Frame overrun</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERR</name>
              <description>Data toggle error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINTMSK0</name>
          <description>OTG_FS host channel-0 mask register (OTG_FS_HCINTMSK0)</description>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALLM</name>
              <description>STALL response received interrupt mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK response received interrupt mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKM</name>
              <description>ACK response received/transmitted interrupt mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NYET</name>
              <description>response received interrupt mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCTSIZ0</name>
          <description>OTG_FS host channel-0 transfer size register</description>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCCHAR1</name>
          <description>OTG_FS host channel-1 characteristics register (OTG_FS_HCCHAR1)</description>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint direction</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-speed device</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multicount</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[28:22]</bitRange>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd frame</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel disable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINT1</name>
          <description>OTG_FS host channel-1 interrupt register (OTG_FS_HCINT1)</description>
          <addressOffset>0x128</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHH</name>
              <description>Channel halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <description>Transaction error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERR</name>
              <description>Babble error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMOR</name>
              <description>Frame overrun</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERR</name>
              <description>Data toggle error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINTMSK1</name>
          <description>OTG_FS host channel-1 mask register (OTG_FS_HCINTMSK1)</description>
          <addressOffset>0x12C</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALLM</name>
              <description>STALL response received interrupt mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK response received interrupt mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKM</name>
              <description>ACK response received/transmitted interrupt mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NYET</name>
              <description>response received interrupt mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCTSIZ1</name>
          <description>OTG_FS host channel-1 transfer size register</description>
          <addressOffset>0x130</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
