Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
        <register>
          <name>FS_HCCHAR2</name>
          <description>OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2)</description>
          <addressOffset>0x140</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint direction</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-speed device</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multicount</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[28:22]</bitRange>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd frame</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel disable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINT2</name>
          <description>OTG_FS host channel-2 interrupt register (OTG_FS_HCINT2)</description>
          <addressOffset>0x148</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHH</name>
              <description>Channel halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <description>Transaction error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERR</name>
              <description>Babble error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMOR</name>
              <description>Frame overrun</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERR</name>
              <description>Data toggle error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINTMSK2</name>
          <description>OTG_FS host channel-2 mask register (OTG_FS_HCINTMSK2)</description>
          <addressOffset>0x14C</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALLM</name>
              <description>STALL response received interrupt mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK response received interrupt mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKM</name>
              <description>ACK response received/transmitted interrupt mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NYET</name>
              <description>response received interrupt mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCTSIZ2</name>
          <description>OTG_FS host channel-2 transfer size register</description>
          <addressOffset>0x150</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCCHAR3</name>
          <description>OTG_FS host channel-3 characteristics register (OTG_FS_HCCHAR3)</description>
          <addressOffset>0x160</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint direction</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-speed device</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multicount</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[28:22]</bitRange>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd frame</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel disable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINT3</name>
          <description>OTG_FS host channel-3 interrupt register (OTG_FS_HCINT3)</description>
          <addressOffset>0x168</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHH</name>
              <description>Channel halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <description>Transaction error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERR</name>
              <description>Babble error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMOR</name>
              <description>Frame overrun</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERR</name>
              <description>Data toggle error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINTMSK3</name>
          <description>OTG_FS host channel-3 mask register (OTG_FS_HCINTMSK3)</description>
          <addressOffset>0x16C</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALLM</name>
              <description>STALL response received interrupt mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK response received interrupt mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKM</name>
              <description>ACK response received/transmitted interrupt mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NYET</name>
              <description>response received interrupt mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCTSIZ3</name>
          <description>OTG_FS host channel-3 transfer size register</description>
          <addressOffset>0x170</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCCHAR4</name>
          <description>OTG_FS host channel-4 characteristics register (OTG_FS_HCCHAR4)</description>
          <addressOffset>0x180</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint direction</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-speed device</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multicount</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[28:22]</bitRange>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd frame</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel disable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINT4</name>
          <description>OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4)</description>
          <addressOffset>0x188</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHH</name>
              <description>Channel halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <description>Transaction error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERR</name>
              <description>Babble error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMOR</name>
              <description>Frame overrun</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERR</name>
              <description>Data toggle error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINTMSK4</name>
          <description>OTG_FS host channel-4 mask register (OTG_FS_HCINTMSK4)</description>
          <addressOffset>0x18C</addressOffset>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALLM</name>
              <description>STALL response received interrupt mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK response received interrupt mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKM</name>
              <description>ACK response received/transmitted interrupt mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NYET</name>
              <description>response received interrupt mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXERRM</name>
              <description>Transaction error mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERRM</name>
              <description>Babble error mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCTSIZ4</name>
          <description>OTG_FS host channel-x transfer size register</description>
          <addressOffset>0x190</addressOffset>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitRange>[18:0]</bitRange>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitRange>[28:19]</bitRange>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCCHAR5</name>
          <description>OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5)</description>
          <addressOffset>0x1A0</addressOffset>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint number</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint direction</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-speed device</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multicount</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DAD</name>
              <description>Device address</description>
              <bitRange>[28:22]</bitRange>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd frame</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHDIS</name>
              <description>Channel disable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CHENA</name>
              <description>Channel enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_HCINT5</name>
          <description>OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5)</description>
          <addressOffset>0x1A8</addressOffset>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHH</name>
              <description>Channel halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <description>Transaction error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BBERR</name>
              <description>Babble error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FRMOR</name>
              <description>Frame overrun</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTERR</name>
              <description>Data toggle error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
