Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/PY32E407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB1_OTG_PWRCLK</name>
      <description>USB on the go full speed</description>
      <baseAddress>0x48040E00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FS_PCGCCTL</name>
          <description>OTG_FS power and clock gating control register (OTG_FS_PCGCCTL)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>STPPCLK</name>
              <description>Stop PHY clock</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GATEHCLK</name>
              <description>Gate HCLK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PHYSUSP</name>
              <description>PHY Suspended</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="USB1_OTG_DEVICE">
      <name>USB2_OTG_DEVICE</name>
      <baseAddress>0x48080800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB1_OTG_GLOBAL">
      <name>USB2_OTG_GLOBAL</name>
      <baseAddress>0x48080000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB1_OTG_HOST">
      <name>USB2_OTG_HOST</name>
      <baseAddress>0x48080400</baseAddress>
      <interrupt>
        <name>OTG2_FS_WKUP</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>OTG2_FS</name>
        <value>82</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USB1_OTG_PWRCLK">
      <name>USB2_OTG_PWRCLK</name>
      <baseAddress>0x48080E00</baseAddress>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WWDG</name>
        <description>Window Watchdog global interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>T</name>
              <description>wwdg 7-bit counter</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>WDGA</name>
              <description>WWDG Activation</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>W</name>
              <description>window value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>WDGTB</name>
              <description>time base</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>EWI</name>
              <description>Early wakeup interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early wakeup interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>